XKCANO/ceshi0223/KD001-0115C/Library/inc/fm33lf0xx_fl_fscan.h
#define    FSCAN_MSR_WUPE_Pos                                       (11U)
#define    FSCAN_MSR_WUPE_Msk                                       (0x1U << FSCAN_MSR_WUPE_Pos)
#define    FSCAN_MSR_WUPE                                           FSCAN_MSR_WUPE_Msk

#define    FSCAN_MSR_AREN_Pos                                       (10U)
#define    FSCAN_MSR_AREN_Msk                                       (0x1U << FSCAN_MSR_AREN_Pos)
#define    FSCAN_MSR_AREN                                           FSCAN_MSR_AREN_Msk

#define    FSCAN_MSR_ABOM_Pos                                       (8U)
#define    FSCAN_MSR_ABOM_Msk                                       (0x3U << FSCAN_MSR_ABOM_Pos)
#define    FSCAN_MSR_ABOM                                           FSCAN_MSR_ABOM_Msk

#define    FSCAN_MSR_RTBO_Pos                                       (7U)
#define    FSCAN_MSR_RTBO_Msk                                       (0x1U << FSCAN_MSR_RTBO_Pos)
#define    FSCAN_MSR_RTBO                                           FSCAN_MSR_RTBO_Msk

#define    FSCAN_MSR_LPBACK_Pos                                     (1U)
#define    FSCAN_MSR_LPBACK_Msk                                     (0x1U << FSCAN_MSR_LPBACK_Pos)
#define    FSCAN_MSR_LPBACK                                         FSCAN_MSR_LPBACK_Msk

#define    FSCAN_MSR_SLEEP_Pos                                      (0U)
#define    FSCAN_MSR_SLEEP_Msk                                      (0x1U << FSCAN_MSR_SLEEP_Pos)
#define    FSCAN_MSR_SLEEP                                          FSCAN_MSR_SLEEP_Msk

#define    FSCAN_BRPR_BRP_Pos                                       (0U)
#define    FSCAN_BRPR_BRP_Msk                                       (0xffU << FSCAN_BRPR_BRP_Pos)
#define    FSCAN_BRPR_BRP                                           FSCAN_BRPR_BRP_Msk

#define    FSCAN_BTR_SJW_Pos                                        (7U)
#define    FSCAN_BTR_SJW_Msk                                        (0x3U << FSCAN_BTR_SJW_Pos)
#define    FSCAN_BTR_SJW                                            FSCAN_BTR_SJW_Msk

#define    FSCAN_BTR_TS2_Pos                                        (4U)
#define    FSCAN_BTR_TS2_Msk                                        (0x7U << FSCAN_BTR_TS2_Pos)
#define    FSCAN_BTR_TS2                                            FSCAN_BTR_TS2_Msk

#define    FSCAN_BTR_TS1_Pos                                        (0U)
#define    FSCAN_BTR_TS1_Msk                                        (0xfU << FSCAN_BTR_TS1_Pos)
#define    FSCAN_BTR_TS1                                            FSCAN_BTR_TS1_Msk

#define    FSCAN_ECR_REC_Pos                                        (8U)
#define    FSCAN_ECR_REC_Msk                                        (0xffU << FSCAN_ECR_REC_Pos)
#define    FSCAN_ECR_REC                                            FSCAN_ECR_REC_Msk

#define    FSCAN_ECR_TEC_Pos                                        (0U)
#define    FSCAN_ECR_TEC_Msk                                        (0xffU << FSCAN_ECR_TEC_Pos)
#define    FSCAN_ECR_TEC                                            FSCAN_ECR_TEC_Msk

#define    FSCAN_ESR_OVLF_Pos                                       (8U)
#define    FSCAN_ESR_OVLF_Msk                                       (0x1U << FSCAN_ESR_OVLF_Pos)
#define    FSCAN_ESR_OVLF                                           FSCAN_ESR_OVLF_Msk

#define    FSCAN_ESR_BLF_Pos                                        (7U)
#define    FSCAN_ESR_BLF_Msk                                        (0x1U << FSCAN_ESR_BLF_Pos)
#define    FSCAN_ESR_BLF                                            FSCAN_ESR_BLF_Msk

#define    FSCAN_ESR_ADERR_Pos                                      (6U)
#define    FSCAN_ESR_ADERR_Msk                                      (0x1U << FSCAN_ESR_ADERR_Pos)
#define    FSCAN_ESR_ADERR                                          FSCAN_ESR_ADERR_Msk

#define    FSCAN_ESR_ACKER_Pos                                      (5U)
#define    FSCAN_ESR_ACKER_Msk                                      (0x1U << FSCAN_ESR_ACKER_Pos)
#define    FSCAN_ESR_ACKER                                          FSCAN_ESR_ACKER_Msk

#define    FSCAN_ESR_B0ERR_Pos                                      (4U)
#define    FSCAN_ESR_B0ERR_Msk                                      (0x1U << FSCAN_ESR_B0ERR_Pos)
#define    FSCAN_ESR_B0ERR                                          FSCAN_ESR_B0ERR_Msk

#define    FSCAN_ESR_B1ERR_Pos                                      (3U)
#define    FSCAN_ESR_B1ERR_Msk                                      (0x1U << FSCAN_ESR_B1ERR_Pos)
#define    FSCAN_ESR_B1ERR                                          FSCAN_ESR_B1ERR_Msk

#define    FSCAN_ESR_STER_Pos                                       (2U)
#define    FSCAN_ESR_STER_Msk                                       (0x1U << FSCAN_ESR_STER_Pos)
#define    FSCAN_ESR_STER                                           FSCAN_ESR_STER_Msk

#define    FSCAN_ESR_FMER_Pos                                       (1U)
#define    FSCAN_ESR_FMER_Msk                                       (0x1U << FSCAN_ESR_FMER_Pos)
#define    FSCAN_ESR_FMER                                           FSCAN_ESR_FMER_Msk

#define    FSCAN_ESR_CRCER_Pos                                      (0U)
#define    FSCAN_ESR_CRCER_Msk                                      (0x1U << FSCAN_ESR_CRCER_Pos)
#define    FSCAN_ESR_CRCER                                          FSCAN_ESR_CRCER_Msk

#define    FSCAN_SR_ACFBSY_Pos                                      (11U)
#define    FSCAN_SR_ACFBSY_Msk                                      (0x1U << FSCAN_SR_ACFBSY_Pos)
#define    FSCAN_SR_ACFBSY                                          FSCAN_SR_ACFBSY_Msk

#define    FSCAN_SR_RXFE_Pos                                        (10U)
#define    FSCAN_SR_RXFE_Msk                                        (0x1U << FSCAN_SR_RXFE_Pos)
#define    FSCAN_SR_RXFE                                            FSCAN_SR_RXFE_Msk

#define    FSCAN_SR_RSTS_Pos                                        (8U)
#define    FSCAN_SR_RSTS_Msk                                        (0x3U << FSCAN_SR_RSTS_Pos)
#define    FSCAN_SR_RSTS                                            FSCAN_SR_RSTS_Msk

