XKCANO/ceshi0223/KD001-0115C/Library/inc/fm33lf0xx_fl_fscan.h
#define    FSCAN_SR_TSTS_Pos                                        (6U)
#define    FSCAN_SR_TSTS_Msk                                        (0x3U << FSCAN_SR_TSTS_Pos)
#define    FSCAN_SR_TSTS                                            FSCAN_SR_TSTS_Msk

#define    FSCAN_SR_BBSY_Pos                                        (5U)
#define    FSCAN_SR_BBSY_Msk                                        (0x1U << FSCAN_SR_BBSY_Pos)
#define    FSCAN_SR_BBSY                                            FSCAN_SR_BBSY_Msk

#define    FSCAN_SR_BIDLE_Pos                                       (4U)
#define    FSCAN_SR_BIDLE_Msk                                       (0x1U << FSCAN_SR_BIDLE_Pos)
#define    FSCAN_SR_BIDLE                                           FSCAN_SR_BIDLE_Msk

#define    FSCAN_SR_NORMAL_Pos                                      (3U)
#define    FSCAN_SR_NORMAL_Msk                                      (0x1U << FSCAN_SR_NORMAL_Pos)
#define    FSCAN_SR_NORMAL                                          FSCAN_SR_NORMAL_Msk

#define    FSCAN_SR_SLEEP_Pos                                       (2U)
#define    FSCAN_SR_SLEEP_Msk                                       (0x1U << FSCAN_SR_SLEEP_Pos)
#define    FSCAN_SR_SLEEP                                           FSCAN_SR_SLEEP_Msk

#define    FSCAN_SR_LBACK_Pos                                       (1U)
#define    FSCAN_SR_LBACK_Msk                                       (0x1U << FSCAN_SR_LBACK_Pos)
#define    FSCAN_SR_LBACK                                           FSCAN_SR_LBACK_Msk

#define    FSCAN_SR_CONFIG_Pos                                      (0U)
#define    FSCAN_SR_CONFIG_Msk                                      (0x1U << FSCAN_SR_CONFIG_Pos)
#define    FSCAN_SR_CONFIG                                          FSCAN_SR_CONFIG_Msk

#define    FSCAN_RXISR_RXFIFO_MC_Pos                               (16U)
#define    FSCAN_RXISR_RXFIFO_MC_Msk                               (0xfU << FSCAN_RXISR_RXFIFO_MC_Pos)
#define    FSCAN_RXISR_RXFIFO_MC                                   FSCAN_RXISR_RXFIFO_MC_Msk

#define    FSCAN_RXISR_BORF_Pos                                    (12U)
#define    FSCAN_RXISR_BORF_Msk                                    (0x1U << FSCAN_RXISR_BORF_Pos)
#define    FSCAN_RXISR_BORF                                        FSCAN_RXISR_BORF_Msk

#define    FSCAN_RXISR_WUPF_Pos                                    (11U)
#define    FSCAN_RXISR_WUPF_Msk                                    (0x1U << FSCAN_RXISR_WUPF_Pos)
#define    FSCAN_RXISR_WUPF                                        FSCAN_RXISR_WUPF_Msk

#define    FSCAN_RXISR_SLPIF_Pos                                   (10U)
#define    FSCAN_RXISR_SLPIF_Msk                                   (0x1U << FSCAN_RXISR_SLPIF_Pos)
#define    FSCAN_RXISR_SLPIF                                       FSCAN_RXISR_SLPIF_Msk

#define    FSCAN_RXISR_ESCF_Pos                                    (9U)
#define    FSCAN_RXISR_ESCF_Msk                                    (0x1U << FSCAN_RXISR_ESCF_Pos)
#define    FSCAN_RXISR_ESCF                                        FSCAN_RXISR_ESCF_Msk

#define    FSCAN_RXISR_ERROR_Pos                                   (8U)
#define    FSCAN_RXISR_ERROR_Msk                                   (0x1U << FSCAN_RXISR_ERROR_Pos)
#define    FSCAN_RXISR_ERROR                                       FSCAN_RXISR_ERROR_Msk

#define    FSCAN_RXISR_RXNEMP_Pos                                  (7U)
#define    FSCAN_RXISR_RXNEMP_Msk                                  (0x1U << FSCAN_RXISR_RXNEMP_Pos)
#define    FSCAN_RXISR_RXNEMP                                      FSCAN_RXISR_RXNEMP_Msk

#define    FSCAN_RXISR_RXOFLW_Pos                                  (6U)
#define    FSCAN_RXISR_RXOFLW_Msk                                  (0x1U << FSCAN_RXISR_RXOFLW_Pos)
#define    FSCAN_RXISR_RXOFLW                                      FSCAN_RXISR_RXOFLW_Msk

#define    FSCAN_RXISR_RXUFLW_Pos                                  (5U)
#define    FSCAN_RXISR_RXUFLW_Msk                                  (0x1U << FSCAN_RXISR_RXUFLW_Pos)
#define    FSCAN_RXISR_RXUFLW                                      FSCAN_RXISR_RXUFLW_Msk

#define    FSCAN_RXISR_RXOK_Pos                                    (4U)
#define    FSCAN_RXISR_RXOK_Msk                                    (0x1U << FSCAN_RXISR_RXOK_Pos)
#define    FSCAN_RXISR_RXOK                                        FSCAN_RXISR_RXOK_Msk

#define    FSCAN_RXISR_ARBLST_Pos                                  (0U)
#define    FSCAN_RXISR_ARBLST_Msk                                  (0x1U << FSCAN_RXISR_ARBLST_Pos)
#define    FSCAN_RXISR_ARBLST                                      FSCAN_RXISR_ARBLST_Msk

#define    FSCAN_RXIER_BORFIE_Pos                                  (12U)
#define    FSCAN_RXIER_BORFIE_Msk                                  (0x1U << FSCAN_RXIER_BORFIE_Pos)
#define    FSCAN_RXIER_BORFIE                                      FSCAN_RXIER_BORFIE_Msk

#define    FSCAN_RXIER_WKUPIE_Pos                                  (11U)
#define    FSCAN_RXIER_WKUPIE_Msk                                  (0x1U << FSCAN_RXIER_WKUPIE_Pos)
#define    FSCAN_RXIER_WKUPIE                                      FSCAN_RXIER_WKUPIE_Msk

#define    FSCAN_RXIER_SLPIE_Pos                                   (10U)
#define    FSCAN_RXIER_SLPIE_Msk                                   (0x1U << FSCAN_RXIER_SLPIE_Pos)
#define    FSCAN_RXIER_SLPIE                                       FSCAN_RXIER_SLPIE_Msk

#define    FSCAN_RXIER_EESCFIE_Pos                                 (9U)
#define    FSCAN_RXIER_EESCFIE_Msk                                 (0x1U << FSCAN_RXIER_EESCFIE_Pos)
#define    FSCAN_RXIER_EESCFIE                                     FSCAN_RXIER_EESCFIE_Msk

#define    FSCAN_RXIER_ERRORIE_Pos                                 (8U)
#define    FSCAN_RXIER_ERRORIE_Msk                                 (0x1U << FSCAN_RXIER_ERRORIE_Pos)
#define    FSCAN_RXIER_ERRORIE                                     FSCAN_RXIER_ERRORIE_Msk

#define    FSCAN_RXIER_RXNEMPIE_Pos                                (7U)
#define    FSCAN_RXIER_RXNEMPIE_Msk                                (0x1U << FSCAN_RXIER_RXNEMPIE_Pos)
#define    FSCAN_RXIER_RXNEMPIE                                    FSCAN_RXIER_RXNEMPIE_Msk

