XKCANO/ceshi0223/KD001-0115C/Library/inc/fm33lf0xx_fl_fscan.h
#define    FSCAN_RXIER_RXOFLWIE_Pos                                (6U)
#define    FSCAN_RXIER_RXOFLWIE_Msk                                (0x1U << FSCAN_RXIER_RXOFLWIE_Pos)
#define    FSCAN_RXIER_RXOFLWIE                                    FSCAN_RXIER_RXOFLWIE_Msk

#define    FSCAN_RXIER_RXUFLWIE_Pos                                (5U)
#define    FSCAN_RXIER_RXUFLWIE_Msk                                (0x1U << FSCAN_RXIER_RXUFLWIE_Pos)
#define    FSCAN_RXIER_RXUFLWIE                                    FSCAN_RXIER_RXUFLWIE_Msk

#define    FSCAN_RXIER_RXOKIE_Pos                                  (4U)
#define    FSCAN_RXIER_RXOKIE_Msk                                  (0x1U << FSCAN_RXIER_RXOKIE_Pos)
#define    FSCAN_RXIER_RXOKIE                                      FSCAN_RXIER_RXOKIE_Msk

#define    FSCAN_RXIER_ARBLSTIE_Pos                                (0U)
#define    FSCAN_RXIER_ARBLSTIE_Msk                                (0x1U << FSCAN_RXIER_ARBLSTIE_Pos)
#define    FSCAN_RXIER_ARBLSTIE                                    FSCAN_RXIER_ARBLSTIE_Msk

#define    FSCAN_TXBCR_TXAR_Pos                                     (8U)
#define    FSCAN_TXBCR_TXAR_Msk                                     (0x7U << FSCAN_TXBCR_TXAR_Pos)
#define    FSCAN_TXBCR_TXAR                                         FSCAN_TXBCR_TXAR_Msk

#define    FSCAN_TXBCR_TXIE_Pos                                     (0U)
#define    FSCAN_TXBCR_TXIE_Msk                                     (0x7U << FSCAN_TXBCR_TXIE_Pos)
#define    FSCAN_TXBCR_TXIE                                         FSCAN_TXBCR_TXIE_Msk

#define    FSCAN_TXBSR_TXRF_Pos                                     (8U)
#define    FSCAN_TXBSR_TXRF_Msk                                     (0x3U << FSCAN_TXBSR_TXRF_Pos)
#define    FSCAN_TXBSR_TXRF                                         FSCAN_TXBSR_TXRF_Msk

#define    FSCAN_TXBSR_TXS_Pos                                      (3U)
#define    FSCAN_TXBSR_TXS_Msk                                      (0x7U << FSCAN_TXBSR_TXS_Pos)
#define    FSCAN_TXBSR_TXS                                          FSCAN_TXBSR_TXS_Msk

#define    FSCAN_TXBSR_TXE0_Pos                                      (0U)
#define    FSCAN_TXBSR_TXE0_Msk                                      (0x1U << FSCAN_TXBSR_TXE0_Pos)
#define    FSCAN_TXBSR_TXE0                                          FSCAN_TXBSR_TXE0_Msk

#define    FSCAN_TXBSR_TXE1_Pos                                      (1U)
#define    FSCAN_TXBSR_TXE1_Msk                                      (0x1U << FSCAN_TXBSR_TXE1_Pos)
#define    FSCAN_TXBSR_TXE1                                          FSCAN_TXBSR_TXE1_Msk

#define    FSCAN_TXBSR_TXE2_Pos                                      (2U)
#define    FSCAN_TXBSR_TXE2_Msk                                      (0x1U << FSCAN_TXBSR_TXE2_Pos)
#define    FSCAN_TXBSR_TXE2                                          FSCAN_TXBSR_TXE2_Msk


#define    FSCAN_TXBIDR_IDR_Pos                                     (0U)
#define    FSCAN_TXBIDR_IDR_Msk                                     (0xffffffffU << FSCAN_TXBIDR_IDR_Pos)
#define    FSCAN_TXBIDR_IDR                                         FSCAN_TXBIDR_IDR_Msk

#define    FSCAN_TXBDLCR_DLC_Pos                                    (0U)
#define    FSCAN_TXBDLCR_DLC_Msk                                    (0xfU << FSCAN_TXBDLCR_DLC_Pos)
#define    FSCAN_TXBDLCR_DLC                                        FSCAN_TXBDLCR_DLC_Msk

#define    FSCAN_TXBDW1R_DB_Pos                                     (0U)
#define    FSCAN_TXBDW1R_DB_Msk                                     (0xffffffffU << FSCAN_TXBDW1R_DB_Pos)
#define    FSCAN_TXBDW1R_DB                                         FSCAN_TXBDW1R_DB_Msk

#define    FSCAN_TXBDW2R_DB_Pos                                     (0U)
#define    FSCAN_TXBDW2R_DB_Msk                                     (0xffffffffU << FSCAN_TXBDW2R_DB_Pos)
#define    FSCAN_TXBDW2R_DB                                         FSCAN_TXBDW2R_DB_Msk

#define    FSCAN_RXFIDR_IDR_Pos                                     (0U)
#define    FSCAN_RXFIDR_IDR_Msk                                     (0xffffffffU << FSCAN_RXFIDR_IDR_Pos)
#define    FSCAN_RXFIDR_IDR                                         FSCAN_RXFIDR_IDR_Msk

#define    FSCAN_RXFDLCR_DLC_Pos                                    (0U)
#define    FSCAN_RXFDLCR_DLC_Msk                                    (0xfU << FSCAN_RXFDLCR_DLC_Pos)
#define    FSCAN_RXFDLCR_DLC                                        FSCAN_RXFDLCR_DLC_Msk

#define    FSCAN_RXFDW1R_DB_Pos                                     (0U)
#define    FSCAN_RXFDW1R_DB_Msk                                     (0xffffffffU << FSCAN_RXFDW1R_DB_Pos)
#define    FSCAN_RXFDW1R_DB                                         FSCAN_RXFDW1R_DB_Msk

#define    FSCAN_RXFDW2R_DB_Pos                                     (0U)
#define    FSCAN_RXFDW2R_DB_Msk                                     (0xffffffffU << FSCAN_RXFDW2R_DB_Pos)
#define    FSCAN_RXFDW2R_DB                                         FSCAN_RXFDW2R_DB_Msk

#define    FSCAN_AFCR_UAF_Pos                                       (0U)
#define    FSCAN_AFCR_UAF_Msk                                       (0x1U << FSCAN_AFCR_UAF_Pos)
#define    FSCAN_AFCR_UAF                                           FSCAN_AFCR_UAF_Msk

#define    FSCAN_AFCFGR_MSKM_Pos                                    (16U)
#define    FSCAN_AFCFGR_MSKM_Msk                                    (0x1U << FSCAN_AFCFGR_MSKM_Pos)
#define    FSCAN_AFCFGR_MSKM                                        FSCAN_AFCFGR_MSKM_Msk

#define    FSCAN_AFCFGR_FSC_Pos                                     (0U)
#define    FSCAN_AFCFGR_FSC_Msk                                     (0x1U << FSCAN_AFCFGR_FSC_Pos)
#define    FSCAN_AFCFGR_FSC                                         FSCAN_AFCFGR_FSC_Msk

#define    FSCAN_AFMR_AMRTR_Pos                                     (31U)
#define    FSCAN_AFMR_AMRTR_Msk                                     (0x1U << FSCAN_AFMR_AMRTR_Pos)
#define    FSCAN_AFMR_AMRTR                                         FSCAN_AFMR_AMRTR_Msk

#define    FSCAN_AFMR_AMID18_Pos                                    (13U)
#define    FSCAN_AFMR_AMID18_Msk                                    (0x3ffffU << FSCAN_AFMR_AMID18_Pos)
#define    FSCAN_AFMR_AMID18                                        FSCAN_AFMR_AMID18_Msk

#define    FSCAN_AFMR_AMIDE_Pos                                     (12U)
#define    FSCAN_AFMR_AMIDE_Msk                                     (0x1U << FSCAN_AFMR_AMIDE_Pos)
#define    FSCAN_AFMR_AMIDE                                         FSCAN_AFMR_AMIDE_Msk

#define    FSCAN_AFMR_AMSRR_Pos                                     (11U)
#define    FSCAN_AFMR_AMSRR_Msk                                     (0x1U << FSCAN_AFMR_AMSRR_Pos)
#define    FSCAN_AFMR_AMSRR                                         FSCAN_AFMR_AMSRR_Msk

#define    FSCAN_AFMR_AMID11_Pos                                    (0U)
#define    FSCAN_AFMR_AMID11_Msk                                    (0x7ffU << FSCAN_AFMR_AMID11_Pos)
#define    FSCAN_AFMR_AMID11                                        FSCAN_AFMR_AMID11_Msk




#define    FSCAN_AFMRSTD2_AMID3_Pos                                 (29U)
#define    FSCAN_AFMRSTD2_AMID3_Msk                                 (0x7U << FSCAN_AFMRSTD2_AMID3_Pos)
#define    FSCAN_AFMRSTD2_AMID3                                      FSCAN_AFMRSTD2_AMID3_Msk

#define    FSCAN_AFMRSTD2_AMIDE_Pos                                 (28U)
#define    FSCAN_AFMRSTD2_AMIDE_Msk                                 (0x1U << FSCAN_AFMRSTD2_AMIDE_Pos)
#define    FSCAN_AFMRSTD2_AMIDE                                      FSCAN_AFMRSTD2_AMIDE_Msk

#define    FSCAN_AFMRSTD2_AMSRR_Pos                                 (27U)
#define    FSCAN_AFMRSTD2_AMSRR_Msk                                 (0x1U << FSCAN_AFMRSTD2_AMSRR_Pos)
#define    FSCAN_AFMRSTD2_AMSRR                                      FSCAN_AFMRSTD2_AMSRR_Msk

#define    FSCAN_AFMRSTD2_AMID11_Pos                                (16U)
#define    FSCAN_AFMRSTD2_AMID11_Msk                                (0x7ffU << FSCAN_AFMRSTD2_AMID11_Pos)
#define    FSCAN_AFMRSTD2_AMID11                                     FSCAN_AFMRSTD2_AMID11_Msk

#define    FSCAN_AFMRSTD1_AMID3_Pos                                 (13U)
#define    FSCAN_AFMRSTD1_AMID3_Msk                                 (0x7U << FSCAN_AFMRSTD1_AMID3_Pos)
#define    FSCAN_AFMRSTD1_AMID3                                      FSCAN_AFMRSTD1_AMID3_Msk

#define    FSCAN_AFMRSTD1_AMIDE_Pos                                 (12U)
#define    FSCAN_AFMRSTD1_AMIDE_Msk                                 (0x1U << FSCAN_AFMRSTD1_AMIDE_Pos)
#define    FSCAN_AFMRSTD1_AMIDE                                     FSCAN_AFMRSTD1_AMIDE_Msk

#define    FSCAN_AFMRSTD1_AMSRR_Pos                                 (11U)
#define    FSCAN_AFMRSTD1_AMSRR_Msk                                 (0x1U << FSCAN_AFMRSTD1_AMSRR_Pos)
#define    FSCAN_AFMRSTD1_AMSRR                                      FSCAN_AFMRSTD1_AMSRR_Msk

#define    FSCAN_AFMRSTD1_AMID11_Pos                                (0U)
#define    FSCAN_AFMRSTD1_AMID11_Msk                                (0x7ffU << FSCAN_AFMRSTD1_AMID11_Pos)
#define    FSCAN_AFMRSTD1_AMID11                                    FSCAN_AFMRSTD1_AMID11_Msk





#define    FSCAN_AFIR_AIRTR_Pos                                     (31U)
#define    FSCAN_AFIR_AIRTR_Msk                                     (0x1U << FSCAN_AFIR_AIRTR_Pos)
#define    FSCAN_AFIR_AIRTR                                         FSCAN_AFIR_AIRTR_Msk

#define    FSCAN_AFIR_AIID18_Pos                                    (13U)
#define    FSCAN_AFIR_AIID18_Msk                                    (0x3ffffU << FSCAN_AFIR_AIID18_Pos)
#define    FSCAN_AFIR_AIID18                                        FSCAN_AFIR_AIID18_Msk

#define    FSCAN_AFIR_AIIDE_Pos                                     (12U)
#define    FSCAN_AFIR_AIIDE_Msk                                     (0x1U << FSCAN_AFIR_AIIDE_Pos)
#define    FSCAN_AFIR_AIIDE                                         FSCAN_AFIR_AIIDE_Msk

#define    FSCAN_AFIR_AISRR_Pos                                     (11U)
#define    FSCAN_AFIR_AISRR_Msk                                     (0x1U << FSCAN_AFIR_AISRR_Pos)
#define    FSCAN_AFIR_AISRR                                         FSCAN_AFIR_AISRR_Msk

#define    FSCAN_AFIR_AIID11_Pos                                    (0U)
#define    FSCAN_AFIR_AIID11_Msk                                    (0x7ffU << FSCAN_AFIR_AIID11_Pos)
#define    FSCAN_AFIR_AIID11                                        FSCAN_AFIR_AIID11_Msk




#define    FSCAN_AFIRSTD2_AIID3_Pos                                  (29U)
#define    FSCAN_AFIRSTD2_AIID3_Msk                                  (0x7U << FSCAN_AFIRSTD2_AIID3_Pos)
#define    FSCAN_AFIRSTD2_AIID3                                      FSCAN_AFIRSTD2_AIID3_Msk

#define    FSCAN_AFIRSTD2_AIIDE_Pos                                  (28U)
#define    FSCAN_AFIRSTD2_AIIDE_Msk                                  (0x1U << FSCAN_AFIRSTD2_AIIDE_Pos)
#define    FSCAN_AFIRSTD2_AIIDE                                      FSCAN_AFIRSTD2_AIIDE_Msk

#define    FSCAN_AFIRSTD2_AISRR_Pos                                  (27U)
#define    FSCAN_AFIRSTD2_AISRR_Msk                                  (0x1U << FSCAN_AFIRSTD2_AISRR_Pos)
#define    FSCAN_AFIRSTD2_AISRR                                      FSCAN_AFIRSTD2_AISRR_Msk

#define    FSCAN_AFIRSTD2_AIID11_Pos                                 (16U)
#define    FSCAN_AFIRSTD2_AIID11_Msk                                 (0x7ffU << FSCAN_AFIRSTD2_AIID11_Pos)
#define    FSCAN_AFIRSTD2_AIID11                                     FSCAN_AFIRSTD2_AIID11_Msk

#define    FSCAN_AFIRSTD1_AIID3_Pos                                  (13U)
#define    FSCAN_AFIRSTD1_AIID3_Msk                                  (0x7U << FSCAN_AFIRSTD1_AIID3_Pos)
#define    FSCAN_AFIRSTD1_AIID3                                      FSCAN_AFIRSTD1_AIID3_Msk

