XKCANO/ceshi0223/KD001-0115C/Library/inc/fm33lf0xx_fl_fscan.h
#define    FSCAN_AFIRSTD1_AIIDE_Pos                                  (12U)
#define    FSCAN_AFIRSTD1_AIIDE_Msk                                  (0x1U << FSCAN_AFIRSTD1_AIIDE_Pos)
#define    FSCAN_AFIRSTD1_AIIDE                                      FSCAN_AFIRSTD1_AIIDE_Msk

#define    FSCAN_AFIRSTD1_AISRR_Pos                                  (11U)
#define    FSCAN_AFIRSTD1_AISRR_Msk                                  (0x1U << FSCAN_AFIRSTD1_AISRR_Pos)
#define    FSCAN_AFIRSTD1_AISRR                                      FSCAN_AFIRSTD1_AISRR_Msk

#define    FSCAN_AFIRSTD1_AIID11_Pos                                 (0U)
#define    FSCAN_AFIRSTD1_AIID11_Msk                                 (0x7ffU << FSCAN_AFIRSTD1_AIID11_Pos)
#define    FSCAN_AFIRSTD1_AIID11                                     FSCAN_AFIRSTD1_AIID11_Msk



#define    FL_FSCAN_SOFTWARE_NO_RESET                               (0x0U << FSCAN_CR_SRST_Pos)
#define    FL_FSCAN_SOFTWARE_RESET                                  (0x1U << FSCAN_CR_SRST_Pos)


#define    FL_FSCAN_TX_PRIORITY_ID                                  (0x0U << FSCAN_MSR_TPRI_Pos)
#define    FL_FSCAN_TX_PRIORITY_BUFFER                              (0x1U << FSCAN_MSR_TPRI_Pos)


#define    FL_FSCAN_AUTO_MANAGE_HARDWARE                            (0x0U << FSCAN_MSR_ABOM_Pos)
#define    FL_FSCAN_AUTO_MANAGE_SOFTWARE_WAIT                       (0x1U << FSCAN_MSR_ABOM_Pos)
#define    FL_FSCAN_AUTO_MANAGE_SOFTWARE_INTERGRATION               (0x2U << FSCAN_MSR_ABOM_Pos)


#define    FL_FSCAN_RX_STATUS_NORMAL                                (0x0U << FSCAN_SR_RSTS_Pos)
#define    FL_FSCAN_RX_STATUS_WARNING                               (0x1U << FSCAN_SR_RSTS_Pos)
#define    FL_FSCAN_RX_STATUS_ERROR                                 (0x2U << FSCAN_SR_RSTS_Pos)
#define    FL_FSCAN_RX_STATUS_BUSOFF                               (0x3U << FSCAN_SR_RSTS_Pos)

#define    FL_FSCAN_TX_STATUS_NORMAL                                (0x0U << FSCAN_SR_TSTS_Pos)
#define    FL_FSCAN_TX_STATUS_WARNING                               (0x1U << FSCAN_SR_TSTS_Pos)
#define    FL_FSCAN_TX_STATUS_ERROR                                 (0x2U << FSCAN_SR_TSTS_Pos)
#define    FL_FSCAN_TX_STATUS_BUSOFF                               (0x3U << FSCAN_SR_TSTS_Pos)

#define    FL_FSCAN_TX_ABORT_NONE                                   (0x0U << FSCAN_TXBCR_TXAR_Pos)
#define    FL_FSCAN_TX_ABORT_BUFFER_0                               (0x1U << FSCAN_TXBCR_TXAR_Pos)
#define    FL_FSCAN_TX_ABORT_BUFFER_1                               (0x2U << FSCAN_TXBCR_TXAR_Pos)
#define    FL_FSCAN_TX_ABORT_BUFFER_0AND1                           (0x3U << FSCAN_TXBCR_TXAR_Pos)
#define    FL_FSCAN_TX_ABORT_BUFFER_2                               (0x4U << FSCAN_TXBCR_TXAR_Pos)
#define    FL_FSCAN_TX_ABORT_BUFFER_0AND2                           (0x5U << FSCAN_TXBCR_TXAR_Pos)
#define    FL_FSCAN_TX_ABORT_BUFFER_1AND2                           (0x6U << FSCAN_TXBCR_TXAR_Pos)
#define    FL_FSCAN_TX_ABORT_ALL                                    (0x7U << FSCAN_TXBCR_TXAR_Pos)


#define    FL_FSCAN_TX_RESULT_NONE                                  (0x0U << FSCAN_TXBSR_TXRF_Pos)
#define    FL_FSCAN_TX_RESULT_ABORT                                 (0x1U << FSCAN_TXBSR_TXRF_Pos)
#define    FL_FSCAN_TX_RESULT_OK_NOABORT                            (0x2U << FSCAN_TXBSR_TXRF_Pos)
#define    FL_FSCAN_TX_RESULT_OK_ABORT                              (0x3U << FSCAN_TXBSR_TXRF_Pos)

#define    FL_FSCAN_TX_BUFFER_ALL_IDLE                              (0x0U << FSCAN_TXBSR_TXS_Pos)
#define    FL_FSCAN_TX_BUFFER_0_BUSY                                (0x1U << FSCAN_TXBSR_TXS_Pos)
#define    FL_FSCAN_TX_BUFFER_1_BUSY                                (0x2U << FSCAN_TXBSR_TXS_Pos)
#define    FL_FSCAN_TX_BUFFER_0AND1_BUSY                            (0x3U << FSCAN_TXBSR_TXS_Pos)
#define    FL_FSCAN_TX_BUFFER_2_BUSY                                (0x4U << FSCAN_TXBSR_TXS_Pos)
#define    FL_FSCAN_TX_BUFFER_0AND2_BUSY                            (0x5U << FSCAN_TXBSR_TXS_Pos)
#define    FL_FSCAN_TX_BUFFER_1AND2_BUSY                            (0x6U << FSCAN_TXBSR_TXS_Pos)
#define    FL_FSCAN_TX_BUFFER_ALL_BUSY                              (0x7U << FSCAN_TXBSR_TXS_Pos)

#define    FL_FSCAN_RTR_BIT_LOW                                     (0x0U << FSCAN_AFIR_AIRTR_Pos)
#define    FL_FSCAN_RTR_BIT_HIGH                                    (0x1U << FSCAN_AFIR_AIRTR_Pos)


#define    FL_FSCAN_IDE_BIT_LOW                                     (0x0U << FSCAN_AFIR_AIIDE_Pos)
#define    FL_FSCAN_IDE_BIT_HIGH                                    (0x1U << FSCAN_AFIR_AIIDE_Pos)


#define    FL_FSCAN_SRR_BIT_LOW                                     (0x0U << FSCAN_AFIR_AISRR_Pos)
#define    FL_FSCAN_SRR_BIT_HIGH                                    (0x1U << FSCAN_AFIR_AISRR_Pos)

#define    FL_FSCAN_STD1IDE_BIT_LOW                               (0x0U << FSCAN_AFIRSTD1_AIIDE_Pos)
#define    FL_FSCAN_STD1IDE_BIT_HIGH                              (0x1U << FSCAN_AFIRSTD1_AIIDE_Pos)

#define    FL_FSCAN_STD1SRR_BIT_LOW                               (0x0U << FSCAN_AFIRSTD1_AISRR_Pos)
#define    FL_FSCAN_STD1SRR_BIT_HIGH                              (0x1U << FSCAN_AFIRSTD1_AISRR_Pos)

#define    FL_FSCAN_STD2IDE_BIT_LOW                               (0x0U << FSCAN_AFIRSTD2_AIIDE_Pos)
#define    FL_FSCAN_STD2IDE_BIT_HIGH                              (0x1U << FSCAN_AFIRSTD2_AIIDE_Pos)

#define    FL_FSCAN_STD2SRR_BIT_LOW                               (0x0U << FSCAN_AFIRSTD2_AISRR_Pos)
#define    FL_FSCAN_STD2SRR_BIT_HIGH                              (0x1U << FSCAN_AFIRSTD2_AISRR_Pos)


#define    FL_FSCAN_MASKMODE_ID                                     (0x1U << FSCAN_AFCFGR_MSKM_Pos)
#define    FL_FSCAN_MASKMODE_MASK                                   (0x0U << FSCAN_AFCFGR_MSKM_Pos)

#define    FL_FSCAN_IDMODE_16BIT                                     (0x1U << FSCAN_AFCFGR_FSC_Pos)
#define    FL_FSCAN_IDMODE_32BIT                                     (0x0U << FSCAN_AFCFGR_FSC_Pos)

