XKCANO/ceshi0223/KD001-0115C/Library/inc/fm33lf0xx_fl_fscan.h
#define    FL_FSCAN_FILTER1                                         0x0U
#define    FL_FSCAN_FILTER2                                         0x1U
#define    FL_FSCAN_FILTER3                                         0x2U
#define    FL_FSCAN_FILTER4                                         0x3U
#define    FL_FSCAN_FILTER5                                         0x4U
#define    FL_FSCAN_FILTER6                                         0x5U
#define    FL_FSCAN_FILTER7                                         0x6U
#define    FL_FSCAN_FILTER8                                         0x7U
#define    FL_FSCAN_FILTER9                                         0x8U
#define    FL_FSCAN_FILTER10                                        0x9U
#define    FL_FSCAN_FILTER11                                        0xAU
#define    FL_FSCAN_FILTER12                                        0xBU
#define    FL_FSCAN_FILTER13                                        0xCU
#define    FL_FSCAN_FILTER14                                        0xDU
#define    FL_FSCAN_FILTER15                                        0xEU
#define    FL_FSCAN_FILTER16                                        0xFU

#define    FL_FSCAN_FILTERMASK1                                     0x1U<<0U
#define    FL_FSCAN_FILTERMASK2                                     0x1U<<1U
#define    FL_FSCAN_FILTERMASK3                                     0x1U<<2U
#define    FL_FSCAN_FILTERMASK4                                     0x1U<<3U

#define    FL_FSCAN_FILTERID1                                        0x1U
#define    FL_FSCAN_FILTERID2                                        0x2U
#define    FL_FSCAN_FILTERID3                                        0x3U
#define    FL_FSCAN_FILTERID4                                        0x4U

#define    FL_FSCAN_BUFFER0                                         0x1U<<0U
#define    FL_FSCAN_BUFFER1                                         0x1U<<1U
#define    FL_FSCAN_BUFFER2                                         0x1U<<2U



#define FL_FSCAN_TS1_1Tq  0U
#define FL_FSCAN_TS1_2Tq  1U
#define FL_FSCAN_TS1_3Tq  2U
#define FL_FSCAN_TS1_4Tq  3U
#define FL_FSCAN_TS1_5Tq  4U
#define FL_FSCAN_TS1_6Tq  5U
#define FL_FSCAN_TS1_7Tq  6U
#define FL_FSCAN_TS1_8Tq  7U
#define FL_FSCAN_TS1_9Tq  8U
#define FL_FSCAN_TS1_10Tq  9U
#define FL_FSCAN_TS1_11Tq  10U
#define FL_FSCAN_TS1_12Tq  11U
#define FL_FSCAN_TS1_13Tq  12U
#define FL_FSCAN_TS1_14Tq  13U
#define FL_FSCAN_TS1_15Tq  14U
#define FL_FSCAN_TS1_16Tq  15U

#define FL_FSCAN_TS2_1Tq  0U
#define FL_FSCAN_TS2_2Tq  1U
#define FL_FSCAN_TS2_3Tq  2U
#define FL_FSCAN_TS2_4Tq  3U
#define FL_FSCAN_TS2_5Tq  4U
#define FL_FSCAN_TS2_6Tq  5U
#define FL_FSCAN_TS2_7Tq  6U
#define FL_FSCAN_TS2_8Tq  7U


#define FL_FSCAN_SJW_1Tq  0U
#define FL_FSCAN_SJW_2Tq  1U
#define FL_FSCAN_SJW_3Tq  2U
#define FL_FSCAN_SJW_4Tq  3U

#define FL_FSCAN_MODE_NORMAL    0U
#define FL_FSCAN_MODE_LOOPBACK  1U
#define FL_FSCAN_MODE_CONFIG    2U
#define FL_FSCAN_MODE_SLEEP     3U



#define FL_FSCAN_FORMAT_STANDARD_DATA    0
#define FL_FSCAN_FORMAT_STANDARD_REMOTE  1
#define FL_FSCAN_FORMAT_EXTEND_DATA      2
#define FL_FSCAN_FORMAT_EXTEND_REMOTE    3

/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup FSCAN_FL_Exported_Functions FSCAN Exported Functions
  * @{
  */

/**
  * @brief    FSCAN enable
  * @rmtoll   CR    CEN    FL_FSCAN_Enable
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_Enable(FSCAN_Type* FSCANx)
{
    SET_BIT(FSCANx->CR, FSCAN_CR_CEN_Msk);
}

/**
  * @brief    Get FSCAN enable status 
  * @rmtoll   CR    CEN    FL_FSCAN_IsEnabled
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsEnabled(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->CR, FSCAN_CR_CEN_Msk) == FSCAN_CR_CEN_Msk);
}

/**
  * @brief    FSCAN disable
  * @rmtoll   CR    CEN    FL_FSCAN_Disable
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_Disable(FSCAN_Type* FSCANx)
{
    CLEAR_BIT(FSCANx->CR, FSCAN_CR_CEN_Msk);
}

/**
  * @brief    Set FSCAN software reset
  * @rmtoll   CR    SRST    FL_FSCAN_EnableSoftwareReset
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_EnableSoftwareReset(FSCAN_Type *FSCANx)
{
    SET_BIT(FSCANx->CR, FSCAN_CR_SRST_Msk);
}

/**
  * @brief    Rx Presync enable
  * @rmtoll   MSR    RX_PRESYNC_EN    FL_FSCAN_EnableRXPresync
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_EnableRXPresync(FSCAN_Type* FSCANx)
{
    SET_BIT(FSCANx->MSR, FSCAN_MSR_RX_PRESYNC_EN_Msk);
}

/**
  * @brief    Rx Presync disable
  * @rmtoll   MSR    RX_PRESYNC_EN    FL_FSCAN_DisableRXPresync
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_DisableRXPresync(FSCAN_Type* FSCANx)
{
    CLEAR_BIT(FSCANx->MSR, FSCAN_MSR_RX_PRESYNC_EN_Msk);
}

/**
  * @brief    Get Rx Presync enable status
  * @rmtoll   MSR    RX_PRESYNC_EN    FL_FSCAN_IsEnabledRXPresync
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsEnabledRXPresync(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->MSR, FSCAN_MSR_RX_PRESYNC_EN_Msk) == FSCAN_MSR_RX_PRESYNC_EN_Msk);
}

/**
  * @brief    Set TX priority
  * @rmtoll   MSR    TPRI    FL_FSCAN_SetTXPriority
  * @param    FSCAN FSCAN instance
  * @param    priority This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_TX_PRIORITY_ID
  *           @arg @ref FL_FSCAN_TX_PRIORITY_BUFFER
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_SetTXPriority(FSCAN_Type* FSCANx, uint32_t priority)
{
    MODIFY_REG(FSCANx->MSR, FSCAN_MSR_TPRI_Msk, priority);
}

/**
  * @brief    Get Tx priority
  * @rmtoll   MSR    TPRI    FL_FSCAN_GetTXPriority
  * @param    FSCAN FSCAN instance
  * @retval   Returned value fscan be one of the following values:
  *           @arg @ref FL_FSCAN_TX_PRIORITY_ID
  *           @arg @ref FL_FSCAN_TX_PRIORITY_BUFFER
  */
__STATIC_INLINE uint32_t FL_FSCAN_GetTXPriority(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->MSR, FSCAN_MSR_TPRI_Msk));
}

/**
  * @brief    wakeup enable
  * @rmtoll   MSR    WUPE    FL_FSCAN_EnableWakeup
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_EnableWakeup(FSCAN_Type* FSCANx)
{
    SET_BIT(FSCANx->MSR, FSCAN_MSR_WUPE_Msk);
}

/**
  * @brief    wakeup disable
  * @rmtoll   MSR    WUPE    FL_FSCAN_DisableWakeup
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_DisableWakeup(FSCAN_Type* FSCANx)
{
    CLEAR_BIT(FSCANx->MSR, FSCAN_MSR_WUPE_Msk);
}

/**
  * @brief    Get wakeup enable status
  * @rmtoll   MSR    WUPE    FL_FSCAN_IsEnabledWakeup
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsEnabledWakeup(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->MSR, FSCAN_MSR_WUPE_Msk) == FSCAN_MSR_WUPE_Msk);
}

/**
  * @brief    Auto resend enable
  * @rmtoll   MSR    AREN    FL_FSCAN_EnableAutoResend
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_EnableAutoResend(FSCAN_Type* FSCANx)
{
    SET_BIT(FSCANx->MSR, FSCAN_MSR_AREN_Msk);
}

/**
  * @brief    Auto resend disable
  * @rmtoll   MSR    AREN    FL_FSCAN_DisableAutoResend
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_DisableAutoResend(FSCAN_Type* FSCANx)
{
    CLEAR_BIT(FSCANx->MSR, FSCAN_MSR_AREN_Msk);
}

/**
  * @brief    Get Auto resend enable status
  * @rmtoll   MSR    AREN    FL_FSCAN_IsEnabledAutoResend
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsEnabledAutoResend(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->MSR, FSCAN_MSR_AREN_Msk) == FSCAN_MSR_AREN_Msk);
}

/**
  * @brief    Set auto bus off management
  * @rmtoll   MSR    ABOM    FL_FSCAN_SetAutoBusOffManagement
  * @param    FSCAN FSCAN instance
  * @param    state This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_AUTO_MANAGE_HARDWARE
  *           @arg @ref FL_FSCAN_AUTO_MANAGE_SOFTWARE_WAIT
  *           @arg @ref FL_FSCAN_AUTO_MANAGE_SOFTWARE_INTEERGRATION
  *           @arg @ref FL_FSCAN_AUTO_MANAGE_HARDWARE
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_SetAutoBusOffManagement(FSCAN_Type* FSCANx, uint32_t state)
{
    MODIFY_REG(FSCANx->MSR, FSCAN_MSR_ABOM_Msk, state);
}

/**
  * @brief    Get auto bus off management
  * @rmtoll   MSR    ABOM    FL_FSCAN_GetAutoBusOffManagement
  * @param    FSCAN FSCAN instance
  * @retval   Returned value fscan be one of the following values:
  *           @arg @ref FL_FSCAN_AUTO_MANAGE_HARDWARE
  *           @arg @ref FL_FSCAN_AUTO_MANAGE_SOFTWARE_WAIT
  *           @arg @ref FL_FSCAN_AUTO_MANAGE_SOFTWARE_INTEERGRATION
  *           @arg @ref FL_FSCAN_AUTO_MANAGE_HARDWARE
  */
__STATIC_INLINE uint32_t FL_FSCAN_GetAutoBusOffManagement(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->MSR, FSCAN_MSR_ABOM_Msk));
}

/**
  * @brief    Software exit busoff enable 
  * @rmtoll   MSR    RTBO    FL_FSCAN_EnableSoftwareExitBusoff
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_EnableSoftwareExitBusoff(FSCAN_Type* FSCANx)
{
    SET_BIT(FSCANx->MSR, FSCAN_MSR_RTBO_Msk);
}

/**
  * @brief    Software exit busoff disable 
  * @rmtoll   MSR    RTBO    FL_FSCAN_DisableSoftwareExitBusoff
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_DisableSoftwareExitBusoff(FSCAN_Type* FSCANx)
{
    CLEAR_BIT(FSCANx->MSR, FSCAN_MSR_RTBO_Msk);
}

/**
  * @brief    Get software exit busoff enable status
  * @rmtoll   MSR    RTBO    FL_FSCAN_IsEnabledSoftwareExitBusoff
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsEnabledSoftwareExitBusoff(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->MSR, FSCAN_MSR_RTBO_Msk) == FSCAN_MSR_RTBO_Msk);
}

/**
  * @brief    Enable loop back mode
  * @rmtoll   MSR    LPBACK    FL_FSCAN_EnableLoopBackMode
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_EnableLoopBackMode(FSCAN_Type* FSCANx)
{
    SET_BIT(FSCANx->MSR, FSCAN_MSR_LPBACK_Msk);
}

/**
  * @brief    Disable loop back mode
  * @rmtoll   MSR    LPBACK    FL_FSCAN_DisableLoopBackMode
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_DisableLoopBackMode(FSCAN_Type* FSCANx)
{
    CLEAR_BIT(FSCANx->MSR, FSCAN_MSR_LPBACK_Msk);
}

/**
  * @brief    Get loop back mode Enable Status
  * @rmtoll   MSR    LPBACK    FL_FSCAN_IsEnabledLoopBackMode
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsEnabledLoopBackMode(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->MSR, FSCAN_MSR_LPBACK_Msk) == FSCAN_MSR_LPBACK_Msk);
}

/**
  * @brief    Enable Sleep mode
  * @rmtoll   MSR    SLEEP    FL_FSCAN_EnableSleepMode
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_EnableSleepMode(FSCAN_Type* FSCANx)
{
    SET_BIT(FSCANx->MSR, FSCAN_MSR_SLEEP_Msk);
}

/**
  * @brief    Disable Sleep mode
  * @rmtoll   MSR    SLEEP    FL_FSCAN_DisableSleepMode
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_DisableSleepMode(FSCAN_Type* FSCANx)
{
    CLEAR_BIT(FSCANx->MSR, FSCAN_MSR_SLEEP_Msk);
}

/**
  * @brief    Get Sleep mode Enable Status
  * @rmtoll   MSR    SLEEP    FL_FSCAN_IsEnabledSleepMode
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsEnabledSleepMode(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->MSR, FSCAN_MSR_SLEEP_Msk) == FSCAN_MSR_SLEEP_Msk);
}

/**
  * @brief    Set baud rate prescaler
  * @rmtoll   BRPR    BRP    FL_FSCAN_WriteBaudRatePrescaler
  * @param    FSCAN FSCAN instance
  * @param    psc 
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_WriteBaudRatePrescaler(FSCAN_Type* FSCANx, uint32_t psc)
{
    MODIFY_REG(FSCANx->BRPR, FSCAN_BRPR_BRP_Msk, (psc << FSCAN_BRPR_BRP_Pos));
}

/**
  * @brief    Get baud rate prescaler
  * @rmtoll   BRPR    BRP    FL_FSCAN_ReadBaudRatePrescaler
  * @param    FSCAN FSCAN instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_FSCAN_ReadBaudRatePrescaler(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->BRPR, FSCAN_BRPR_BRP_Msk) >> FSCAN_BRPR_BRP_Pos);
}

/**
  * @brief    Set synchronization jump width
  * @rmtoll   BTR    SJW    FL_FSCAN_WriteSyncJumpWidth
  * @param    FSCAN FSCAN instance
  * @param    width 
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_WriteSyncJumpWidth(FSCAN_Type* FSCANx, uint32_t width)
{
    MODIFY_REG(FSCANx->BTR, FSCAN_BTR_SJW_Msk, (width << FSCAN_BTR_SJW_Pos));
}

/**
  * @brief    Get synchronization jump width
  * @rmtoll   BTR    SJW    FL_FSCAN_ReadSyncJumpWidth
  * @param    FSCAN FSCAN instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_FSCAN_ReadSyncJumpWidth(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->BTR, FSCAN_BTR_SJW_Msk) >> FSCAN_BTR_SJW_Pos);
}

/**
  * @brief    Set time segment2 length
  * @rmtoll   BTR    TS2    FL_FSCAN_WriteTimeSegment2Length
  * @param    FSCAN FSCAN instance
  * @param    length 
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_WriteTimeSegment2Length(FSCAN_Type* FSCANx, uint32_t length)
{
    MODIFY_REG(FSCANx->BTR, FSCAN_BTR_TS2_Msk, (length << FSCAN_BTR_TS2_Pos));
}

/**
  * @brief    Get time segment2 length
  * @rmtoll   BTR    TS2    FL_FSCAN_ReadTimeSegment2Length
  * @param    FSCAN FSCAN instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_FSCAN_ReadTimeSegment2Length(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->BTR, FSCAN_BTR_TS2_Msk) >> FSCAN_BTR_TS2_Pos);
}

/**
  * @brief    Set time segment2 length
  * @rmtoll   BTR    TS1    FL_FSCAN_WriteTimeSegment1Length
  * @param    FSCAN FSCAN instance
  * @param    length 
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_WriteTimeSegment1Length(FSCAN_Type* FSCANx, uint32_t length)
{
    MODIFY_REG(FSCANx->BTR, FSCAN_BTR_TS1_Msk, (length << FSCAN_BTR_TS1_Pos));
}

/**
  * @brief    Get time segment2 length
  * @rmtoll   BTR    TS1    FL_FSCAN_ReadTimeSegment1Length
  * @param    FSCAN FSCAN instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_FSCAN_ReadTimeSegment1Length(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->BTR, FSCAN_BTR_TS1_Msk) >> FSCAN_BTR_TS1_Pos);
}

/**
  * @brief    Get receive error number 
  * @rmtoll   ECR    REC    FL_FSCAN_ReadRXErrorCount
  * @param    FSCAN FSCAN instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_FSCAN_ReadRXErrorCount(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->ECR, FSCAN_ECR_REC_Msk) >> FSCAN_ECR_REC_Pos);
}

/**
  * @brief    Get transmit error number
  * @rmtoll   ECR    TEC    FL_FSCAN_ReadTXErrorCount
  * @param    FSCAN FSCAN instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_FSCAN_ReadTXErrorCount(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->ECR, FSCAN_ECR_TEC_Msk) >> FSCAN_ECR_TEC_Pos);
}

/**
  * @brief    Get Overload flag
  * @rmtoll   ESR    OVLF    FL_FSCAN_IsActiveFlag_Overload
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_Overload(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->ESR, FSCAN_ESR_OVLF_Msk) == (FSCAN_ESR_OVLF_Msk));
}

/**
  * @brief    Clear Overload flag
  * @rmtoll   ESR    OVLF    FL_FSCAN_ClearFlag_Overload
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_ClearFlag_Overload(FSCAN_Type* FSCANx)
{
    WRITE_REG(FSCANx->ESR, FSCAN_ESR_OVLF_Msk);
}

/**
  * @brief    Get Bus Lock flag
  * @rmtoll   ESR    BLF    FL_FSCAN_IsActiveFlag_Buslock
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_Buslock(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->ESR, FSCAN_ESR_BLF_Msk) == (FSCAN_ESR_BLF_Msk));
}

/**
  * @brief    Clear Bus Lock flag
  * @rmtoll   ESR    BLF    FL_FSCAN_ClearFlag_Buslock
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_ClearFlag_Buslock(FSCAN_Type* FSCANx)
{
    WRITE_REG(FSCANx->ESR, FSCAN_ESR_BLF_Msk);
}

/**
  * @brief    Get ACK Delimiter error flag
  * @rmtoll   ESR    ADERR    FL_FSCAN_IsActiveFlag_AckDelimiterError
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_AckDelimiterError(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->ESR, FSCAN_ESR_ADERR_Msk) == (FSCAN_ESR_ADERR_Msk));
}

/**
  * @brief    Clear ACK Delimiter error flag
  * @rmtoll   ESR    ADERR    FL_FSCAN_ClearFlag_AckDelimiterError
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_ClearFlag_AckDelimiterError(FSCAN_Type* FSCANx)
{
    WRITE_REG(FSCANx->ESR, FSCAN_ESR_ADERR_Msk);
}

/**
  * @brief    Get ACK error flag
  * @rmtoll   ESR    ACKER    FL_FSCAN_IsActiveFlag_AckError
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_AckError(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->ESR, FSCAN_ESR_ACKER_Msk) == (FSCAN_ESR_ACKER_Msk));
}

/**
  * @brief    Clear ACK error flag
  * @rmtoll   ESR    ACKER    FL_FSCAN_ClearFlag_AckError
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_ClearFlag_AckError(FSCAN_Type* FSCANx)
{
    WRITE_REG(FSCANx->ESR, FSCAN_ESR_ACKER_Msk);
}

/**
  * @brief    Get receive bit 0 error flag
  * @rmtoll   ESR    B0ERR    FL_FSCAN_IsActiveFlag_Bit0Error
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_Bit0Error(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->ESR, FSCAN_ESR_B0ERR_Msk) == (FSCAN_ESR_B0ERR_Msk));
}

/**
  * @brief    Clear receive bit 0 error flag
  * @rmtoll   ESR    B0ERR    FL_FSCAN_ClearFlag_Bit0Error
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_ClearFlag_Bit0Error(FSCAN_Type* FSCANx)
{
    WRITE_REG(FSCANx->ESR, FSCAN_ESR_B0ERR_Msk);
}

/**
  * @brief    Get receive bit 1 error flag
  * @rmtoll   ESR    B1ERR    FL_FSCAN_IsActiveFlag_Bit1Error
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_Bit1Error(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->ESR, FSCAN_ESR_B1ERR_Msk) == (FSCAN_ESR_B1ERR_Msk));
}

/**
  * @brief    Clear receive bit 1 error flag
  * @rmtoll   ESR    B1ERR    FL_FSCAN_ClearFlag_Bit1Error
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_ClearFlag_Bit1Error(FSCAN_Type* FSCANx)
{
    WRITE_REG(FSCANx->ESR, FSCAN_ESR_B1ERR_Msk);
}

/**
  * @brief    Get stuffing error flag
  * @rmtoll   ESR    STER    FL_FSCAN_IsActiveFlag_StuffError
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_StuffError(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->ESR, FSCAN_ESR_STER_Msk) == (FSCAN_ESR_STER_Msk));
}

/**
  * @brief    Clear stuffing error flag
  * @rmtoll   ESR    STER    FL_FSCAN_ClearFlag_StuffError
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_ClearFlag_StuffError(FSCAN_Type* FSCANx)
{
    WRITE_REG(FSCANx->ESR, FSCAN_ESR_STER_Msk);
}

/**
  * @brief    Get form error flag
  * @rmtoll   ESR    FMER    FL_FSCAN_IsActiveFlag_FormatError
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_FormatError(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->ESR, FSCAN_ESR_FMER_Msk) == (FSCAN_ESR_FMER_Msk));
}

/**
  * @brief    Clear form error flag
  * @rmtoll   ESR    FMER    FL_FSCAN_ClearFlag_FormatError
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_ClearFlag_FormatError(FSCAN_Type* FSCANx)
{
    WRITE_REG(FSCANx->ESR, FSCAN_ESR_FMER_Msk);
}

/**
  * @brief    Get CRC error fiag
  * @rmtoll   ESR    CRCER    FL_FSCAN_IsActiveFlag_CRCError
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_CRCError(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->ESR, FSCAN_ESR_CRCER_Msk) == (FSCAN_ESR_CRCER_Msk));
}

/**
  * @brief    Clear CRC error flag
  * @rmtoll   ESR    CRCER    FL_FSCAN_ClearFlag_CRCError
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_ClearFlag_CRCError(FSCAN_Type* FSCANx)
{
    WRITE_REG(FSCANx->ESR, FSCAN_ESR_CRCER_Msk);
}

/**
  * @brief    Get acceptance filter busy flag
  * @rmtoll   SR    ACFBSY    FL_FSCAN_IsActiveFlag_FilterBusy
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_FilterBusy(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->SR, FSCAN_SR_ACFBSY_Msk) == (FSCAN_SR_ACFBSY_Msk));
}

/**
  * @brief    Get transmit FIFO FULL interrupt flag 
  * @rmtoll   SR    RXFE    FL_FSCAN_IsActiveFlag_RXBuffEmpty
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_RXBufferEmpty(FSCAN_Type *FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->SR, FSCAN_SR_RXFE_Msk) == (FSCAN_SR_RXFE_Msk));
}

/**
  * @brief    Get RX error status
  * @rmtoll   SR    RSTS    FL_FSCAN_GetRXErrorStatus
  * @param    FSCAN FSCAN instance
  * @retval   Returned value fscan be one of the following values:
  *           @arg @ref FL_FSCAN_RX_STATUS_NORMAL
  *           @arg @ref FL_FSCAN_RX_STATUS_WARNING
  *           @arg @ref FL_FSCAN_RX_STATUS_ERROR
  *           @arg @ref FL_FSCAN_RX_STATUS_BUS_OFF
  */
__STATIC_INLINE uint32_t FL_FSCAN_GetRXErrorStatus(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->SR, FSCAN_SR_RSTS_Msk));
}

/**
  * @brief    Get TX error status 
  * @rmtoll   SR    TSTS    FL_FSCAN_GetTXErrorStatus
  * @param    FSCAN FSCAN instance
  * @retval   Returned value fscan be one of the following values:
  *           @arg @ref FL_FSCAN_TX_STATUS_NORMAL
  *           @arg @ref FL_FSCAN_TX_STATUS_WARNING
  *           @arg @ref FL_FSCAN_TX_STATUS_ERROR
  *           @arg @ref FL_FSCAN_TX_STATUS_BUS_OFF
  */
__STATIC_INLINE uint32_t FL_FSCAN_GetTXErrorStatus(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->SR, FSCAN_SR_TSTS_Msk));
}

/**
  * @brief    Get bus busy flag
  * @rmtoll   SR    BBSY    FL_FSCAN_IsActiveFlag_BusBusy
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_BusBusy(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->SR, FSCAN_SR_BBSY_Msk) == (FSCAN_SR_BBSY_Msk));
}

/**
  * @brief    Get bus IDLE flag 
  * @rmtoll   SR    BIDLE    FL_FSCAN_IsActiveFlag_BusIdle
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_BusIdle(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->SR, FSCAN_SR_BIDLE_Msk) == (FSCAN_SR_BIDLE_Msk));
}

/**
  * @brief    Get normal mode flag
  * @rmtoll   SR    NORMAL    FL_FSCAN_IsActiveFlag_NormalMode
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_NormalMode(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->SR, FSCAN_SR_NORMAL_Msk) == (FSCAN_SR_NORMAL_Msk));
}

