XKCANO/ceshi0223/KD001-0115C/Library/inc/fm33lf0xx_fl_fscan.h
/**
  * @brief    Get sleep mode flag 
  * @rmtoll   SR    SLEEP    FL_FSCAN_IsActiveFlag_Sleep
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_SleepMode(FSCAN_Type *FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->SR, FSCAN_SR_SLEEP_Msk) == (FSCAN_SR_SLEEP_Msk));
}

/**
  * @brief    Get loop back mode flag 
  * @rmtoll   SR    LBACK    FL_FSCAN_IsActiveFlag_LoopbackMode
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_LoopbackMode(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->SR, FSCAN_SR_LBACK_Msk) == (FSCAN_SR_LBACK_Msk));
}

/**
  * @brief    Get configuration mode flag
  * @rmtoll   SR    CONFIG    FL_FSCAN_IsActiveFlag_ConfigMode
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_ConfigMode(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->SR, FSCAN_SR_CONFIG_Msk) == (FSCAN_SR_CONFIG_Msk));
}

/**
  * @brief    Get bus off recovery interrupt flag
  * @rmtoll   RXISR    BORF    FL_FSCAN_IsActiveFlag_BusOffRecovery
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_BusOffRecovery(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXISR, FSCAN_RXISR_BORF_Msk) == (FSCAN_RXISR_BORF_Msk));
}

/**
  * @brief    Clear bus off recovery interrupt flag
  * @rmtoll   RXISR    BORF    FL_FSCAN_ClearFlag_ErrorStatusChange
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_ClearFlag_BusOffRecovery(FSCAN_Type *FSCANx)
{
    WRITE_REG(FSCANx->RXISR, FSCAN_RXISR_BORF_Msk);
}

/**
  * @brief    Get wakeup interrupt flag
  * @rmtoll   RXISR    WUPF    FL_FSCAN_IsActiveFlag_Wakeup
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_Wakeup(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXISR, FSCAN_RXISR_WUPF_Msk) == (FSCAN_RXISR_WUPF_Msk));
}

/**
  * @brief    Clear wakeup interrupt flag
  * @rmtoll   RXISR    WUPF    FL_FSCAN_ClearFlag_Wakeup
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_ClearFlag_Wakeup(FSCAN_Type* FSCANx)
{
    WRITE_REG(FSCANx->RXISR, FSCAN_RXISR_WUPF_Msk);
}

/**
  * @brief    Get wakeup interrupt flag
  * @rmtoll   RXISR    SLPIF    FL_FSCAN_IsActiveFlag_Sleep
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_Sleep(FSCAN_Type *FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXISR, FSCAN_RXISR_SLPIF_Msk) == (FSCAN_RXISR_SLPIF_Msk));
}

/**
  * @brief    Clear sleep interrupt flag
  * @rmtoll   RXISR    SLPIF    FL_FSCAN_ClearFlag_Sleep
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_ClearFlag_Sleep(FSCAN_Type* FSCANx)
{
    WRITE_REG(FSCANx->RXISR, FSCAN_RXISR_SLPIF_Msk);
}

/**
  * @brief    Get error status change interrupt flag
  * @rmtoll   RXISR    ESCF    FL_FSCAN_IsActiveFlag_ErrorChange
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_ErrorChange(FSCAN_Type *FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXISR, FSCAN_RXISR_ESCF_Msk) == (FSCAN_RXISR_ESCF_Msk));
}

/**
  * @brief    Clear error status change interrupt flag
  * @rmtoll   RXISR    ESCF    FL_FSCAN_ClearFlag_ErrorChange
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_ClearFlag_ErrorChange(FSCAN_Type *FSCANx)
{
    WRITE_REG(FSCANx->RXISR, FSCAN_RXISR_ESCF_Msk);
}

/**
  * @brief    Get error interrupt  flag
  * @rmtoll   RXISR    ERROR    FL_FSCAN_IsActiveFlag_Error
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_Error(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXISR, FSCAN_RXISR_ERROR_Msk) == (FSCAN_RXISR_ERROR_Msk));
}

/**
  * @brief    Clear error interrupt flag
  * @rmtoll   RXISR    ERROR    FL_FSCAN_ClearFlag_Error
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_ClearFlag_Error(FSCAN_Type* FSCANx)
{
    WRITE_REG(FSCANx->RXISR, FSCAN_RXISR_ERROR_Msk);
}

/**
  * @brief    Get receive FIFO not empty interrupt flag
  * @rmtoll   RXISR    RXNEMP    FL_FSCAN_IsActiveFlag_RXNotEmpty
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_RXNotEmpty(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXISR, FSCAN_RXISR_RXNEMP_Msk) == (FSCAN_RXISR_RXNEMP_Msk));
}

/**
  * @brief    Clear receive FIFO not empty interrupt flag
  * @rmtoll   RXISR    RXNEMP    FL_FSCAN_ClearFlag_RXNotEmpty
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_ClearFlag_RXNotEmpty(FSCAN_Type* FSCANx)
{
    WRITE_REG(FSCANx->RXISR, FSCAN_RXISR_RXNEMP_Msk);
}

/**
  * @brief    Get receive FIFO overflow interrupt flag
  * @rmtoll   RXISR    RXOFLW    FL_FSCAN_IsActiveFlag_RXOverflow
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_RXOverflow(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXISR, FSCAN_RXISR_RXOFLW_Msk) == (FSCAN_RXISR_RXOFLW_Msk));
}

/**
  * @brief    Clear  receive FIFO overflow interrupt flag
  * @rmtoll   RXISR    RXOFLW    FL_FSCAN_ClearFlag_RXOverflow
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_ClearFlag_RXOverflow(FSCAN_Type* FSCANx)
{
    WRITE_REG(FSCANx->RXISR, FSCAN_RXISR_RXOFLW_Msk);
}

/**
  * @brief    Get receive FIFO empty interrupt flag
  * @rmtoll   RXISR    RXUFLW    FL_FSCAN_IsActiveFlag_RXEmpty
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_RXUnderflow(FSCAN_Type *FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXISR, FSCAN_RXISR_RXUFLW_Msk) == (FSCAN_RXISR_RXUFLW_Msk));
}

/**
  * @brief    Clear receive FIFO underflow interrupt flag
  * @rmtoll   RXISR    RXUFLW    FL_FSCAN_ClearFlag_RXEmpty
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_ClearFlag_RXUnderflow(FSCAN_Type *FSCANx)
{
    WRITE_REG(FSCANx->RXISR, FSCAN_RXISR_RXUFLW_Msk);
}

/**
  * @brief    Get receive Ok interrupt flag
  * @rmtoll   RXISR    RXOK    FL_FSCAN_IsActiveFlag_RXOK
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_RXOK(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXISR, FSCAN_RXISR_RXOK_Msk) == (FSCAN_RXISR_RXOK_Msk));
}

/**
  * @brief    Clear receive OK interrupt flag
  * @rmtoll   RXISR    RXOK    FL_FSCAN_ClearFlag_CRXOK
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_ClearFlag_RXOK(FSCAN_Type *FSCANx)
{
    WRITE_REG(FSCANx->RXISR, FSCAN_RXISR_RXOK_Msk);
}

/**
  * @brief    Get arbitration lost interrupt flag 
  * @rmtoll   RXISR    ARBLST    FL_FSCAN_IsActiveFlag_ArbitrationLost
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_ArbitrationLost(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXISR, FSCAN_RXISR_ARBLST_Msk) == (FSCAN_RXISR_ARBLST_Msk));
}

/**
  * @brief    Clear arbitration lost interrupt flag
  * @rmtoll   RXISR    ARBLST    FL_FSCAN_ClearFlag_ArbitrationLost
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_ClearFlag_ArbitrationLost(FSCAN_Type* FSCANx)
{
    WRITE_REG(FSCANx->RXISR, FSCAN_RXISR_ARBLST_Msk);
}

/**
  * @brief    Bus off recovery interrupt enable 
  * @rmtoll   RXIER    BORFIE    FL_FSCAN_EnableIT_BusOffRecovery
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_EnableIT_BusOffRecovery(FSCAN_Type* FSCANx)
{
    SET_BIT(FSCANx->RXIER, FSCAN_RXIER_BORFIE_Msk);
}

/**
  * @brief    Bus off recovery  interrupt enable status 
  * @rmtoll   RXIER    BORFIE    FL_FSCAN_IsEnabledIT_BusOffRecovery
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsEnabledIT_BusOffRecovery(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXIER, FSCAN_RXIER_BORFIE_Msk) == FSCAN_RXIER_BORFIE_Msk);
}

/**
  * @brief    Bus off recovery  interrupt disable 
  * @rmtoll   RXIER    BORFIE    FL_FSCAN_DisableIT_BusOffRecovery
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_DisableIT_BusOffRecovery(FSCAN_Type* FSCANx)
{
    CLEAR_BIT(FSCANx->RXIER, FSCAN_RXIER_BORFIE_Msk);
}

/**
  * @brief    Wakeup interrupt enable 
  * @rmtoll   RXIER    WKUPIE    FL_FSCAN_EnableIT_Wakeup
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_EnableIT_Wakeup(FSCAN_Type* FSCANx)
{
    SET_BIT(FSCANx->RXIER, FSCAN_RXIER_WKUPIE_Msk);
}

/**
  * @brief    Wakeup  interrupt enable status 
  * @rmtoll   RXIER    WKUPIE    FL_FSCAN_IsEnabledIT_Wakeup
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsEnabledIT_Wakeup(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXIER, FSCAN_RXIER_WKUPIE_Msk) == FSCAN_RXIER_WKUPIE_Msk);
}

/**
  * @brief    Wakeup  interrupt disable 
  * @rmtoll   RXIER    WKUPIE    FL_FSCAN_DisableIT_Wakeup
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_DisableIT_Wakeup(FSCAN_Type* FSCANx)
{
    CLEAR_BIT(FSCANx->RXIER, FSCAN_RXIER_WKUPIE_Msk);
}

/**
  * @brief    Sleep interrupt enable 
  * @rmtoll   RXIER    SLPIE    FL_FSCAN_EnableIT_Sleep
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_EnableIT_Sleep(FSCAN_Type* FSCANx)
{
    SET_BIT(FSCANx->RXIER, FSCAN_RXIER_SLPIE_Msk);
}

/**
  * @brief    Sleep  interrupt enable status 
  * @rmtoll   RXIER    SLPIE    FL_FSCAN_IsEnabledIT_Sleep
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsEnabledIT_Sleep(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXIER, FSCAN_RXIER_SLPIE_Msk) == FSCAN_RXIER_SLPIE_Msk);
}

/**
  * @brief    Sleep  interrupt disable 
  * @rmtoll   RXIER    SLPIE    FL_FSCAN_DisableIT_Sleep
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_DisableIT_Sleep(FSCAN_Type* FSCANx)
{
    CLEAR_BIT(FSCANx->RXIER, FSCAN_RXIER_SLPIE_Msk);
}

/**
  * @brief    Error change interrupt enable 
  * @rmtoll   RXIER    EESCFIE    FL_FSCAN_EnableIT_ErrorChange
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_EnableIT_ErrorChange(FSCAN_Type* FSCANx)
{
    SET_BIT(FSCANx->RXIER, FSCAN_RXIER_EESCFIE_Msk);
}

/**
  * @brief    Get Error change  interrupt enable status 
  * @rmtoll   RXIER    EESCFIE    FL_FSCAN_IsEnabledIT_ErrorChange
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsEnabledIT_ErrorChange(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXIER, FSCAN_RXIER_EESCFIE_Msk) == FSCAN_RXIER_EESCFIE_Msk);
}

/**
  * @brief    Error change  interrupt disable 
  * @rmtoll   RXIER    EESCFIE    FL_FSCAN_DisableIT_ErrorChange
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_DisableIT_ErrorChange(FSCAN_Type* FSCANx)
{
    CLEAR_BIT(FSCANx->RXIER, FSCAN_RXIER_EESCFIE_Msk);
}

/**
  * @brief    Error interrupt enable
  * @rmtoll   RXIER    ERRORIE    FL_FSCAN_EnableIT_Error
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_EnableIT_Error(FSCAN_Type* FSCANx)
{
    SET_BIT(FSCANx->RXIER, FSCAN_RXIER_ERRORIE_Msk);
}

/**
  * @brief    Get error interrupt enable status
  * @rmtoll   RXIER    ERRORIE    FL_FSCAN_IsEnabledIT_Error
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsEnabledIT_Error(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXIER, FSCAN_RXIER_ERRORIE_Msk) == FSCAN_RXIER_ERRORIE_Msk);
}

/**
  * @brief    Error interrupt disable
  * @rmtoll   RXIER    ERRORIE    FL_FSCAN_DisableIT_Error
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_DisableIT_Error(FSCAN_Type* FSCANx)
{
    CLEAR_BIT(FSCANx->RXIER, FSCAN_RXIER_ERRORIE_Msk);
}

/**
  * @brief    Receive FIFO not empty interrupt enable
  * @rmtoll   RXIER    RXNEMPIE    FL_FSCAN_EnableIT_RXNotEmpty
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_EnableIT_RXNotEmpty(FSCAN_Type* FSCANx)
{
    SET_BIT(FSCANx->RXIER, FSCAN_RXIER_RXNEMPIE_Msk);
}

/**
  * @brief    Get receive FIFO not empty interrupt enable status
  * @rmtoll   RXIER    RXNEMPIE    FL_FSCAN_IsEnabledIT_RXNotEmpty
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsEnabledIT_RXNotEmpty(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXIER, FSCAN_RXIER_RXNEMPIE_Msk) == FSCAN_RXIER_RXNEMPIE_Msk);
}

/**
  * @brief    Receive FIFO not empty interrupt disable
  * @rmtoll   RXIER    RXNEMPIE    FL_FSCAN_DisableIT_RXNotEmpty
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_DisableIT_RXNotEmpty(FSCAN_Type* FSCANx)
{
    CLEAR_BIT(FSCANx->RXIER, FSCAN_RXIER_RXNEMPIE_Msk);
}

/**
  * @brief    Receive FIFO overflow interrupt ennable
  * @rmtoll   RXIER    RXOFLWIE    FL_FSCAN_EnableIT_RXOverflow
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_EnableIT_RXOverflow(FSCAN_Type* FSCANx)
{
    SET_BIT(FSCANx->RXIER, FSCAN_RXIER_RXOFLWIE_Msk);
}

/**
  * @brief    Get receive FIFO overflow interrupt enable status
  * @rmtoll   RXIER    RXOFLWIE    FL_FSCAN_IsEnabledIT_RXOverflow
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsEnabledIT_RXOverflow(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXIER, FSCAN_RXIER_RXOFLWIE_Msk) == FSCAN_RXIER_RXOFLWIE_Msk);
}

/**
  * @brief    Receive FIFO overflow interrupt disable
  * @rmtoll   RXIER    RXOFLWIE    FL_FSCAN_DisableIT_RXOverflow
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_DisableIT_RXOverflow(FSCAN_Type* FSCANx)
{
    CLEAR_BIT(FSCANx->RXIER, FSCAN_RXIER_RXOFLWIE_Msk);
}

/**
  * @brief    Receive FIFO empty interrupt enable 
  * @rmtoll   RXIER    RXUFLWIE    FL_FSCAN_EnableIT_RXEmpty
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_EnableIT_RXUnderflow(FSCAN_Type *FSCANx)
{
    SET_BIT(FSCANx->RXIER, FSCAN_RXIER_RXUFLWIE_Msk);
}

/**
  * @brief    Get receive FIFO empty interrupt enable status
  * @rmtoll   RXIER    RXUFLWIE    FL_FSCAN_IsEnabledIT_RXEmpty
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsEnabledIT_RXUnderflow(FSCAN_Type *FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXIER, FSCAN_RXIER_RXUFLWIE_Msk) == FSCAN_RXIER_RXUFLWIE_Msk);
}

/**
  * @brief    Receive FIFO empty interrupt disable 
  * @rmtoll   RXIER    RXUFLWIE    FL_FSCAN_DisableIT_RXEmpty
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_DisableIT_RXUnderflow(FSCAN_Type *FSCANx)
{
    CLEAR_BIT(FSCANx->RXIER, FSCAN_RXIER_RXUFLWIE_Msk);
}

/**
  * @brief    Receive OK interrupt enable
  * @rmtoll   RXIER    RXOKIE    FL_FSCAN_EnableIT_RXOK
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_EnableIT_RXOK(FSCAN_Type* FSCANx)
{
    SET_BIT(FSCANx->RXIER, FSCAN_RXIER_RXOKIE_Msk);
}

/**
  * @brief    Get receive OK interrupt enable
  * @rmtoll   RXIER    RXOKIE    FL_FSCAN_IsEnabledIT_RXOK
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsEnabledIT_RXOK(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXIER, FSCAN_RXIER_RXOKIE_Msk) == FSCAN_RXIER_RXOKIE_Msk);
}

/**
  * @brief    Receive OK interrupt disable
  * @rmtoll   RXIER    RXOKIE    FL_FSCAN_DisableIT_RXOK
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_DisableIT_RXOK(FSCAN_Type* FSCANx)
{
    CLEAR_BIT(FSCANx->RXIER, FSCAN_RXIER_RXOKIE_Msk);
}

/**
  * @brief    Arbitration lost interrupt enable
  * @rmtoll   RXIER    ARBLSTIE    FL_FSCAN_EnableIT_ArbitrationLost
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_EnableIT_ArbitrationLost(FSCAN_Type* FSCANx)
{
    SET_BIT(FSCANx->RXIER, FSCAN_RXIER_ARBLSTIE_Msk);
}

/**
  * @brief    Get arbitration lost interrupt enable
  * @rmtoll   RXIER    ARBLSTIE    FL_FSCAN_IsEnabledIT_ArbitrationLost
  * @param    FSCAN FSCAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsEnabledIT_ArbitrationLost(FSCAN_Type* FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXIER, FSCAN_RXIER_ARBLSTIE_Msk) == FSCAN_RXIER_ARBLSTIE_Msk);
}

/**
  * @brief    Arbitration lost interrupt disable
  * @rmtoll   RXIER    ARBLSTIE    FL_FSCAN_DisableIT_ArbitrationLost
  * @param    FSCAN FSCAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_DisableIT_ArbitrationLost(FSCAN_Type* FSCANx)
{
    CLEAR_BIT(FSCANx->RXIER, FSCAN_RXIER_ARBLSTIE_Msk);
}

/**
  * @brief    Set Tx abort request
  * @rmtoll   TXBCR    TXAR    FL_FSCAN_SetTXAbortRequest
  * @param    FSCAN FSCAN instance
  * @param    buffer This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_TX_ABORT_NONE
  *           @arg @ref FL_FSCAN_TX_ABORT_BUFFER_0
  *           @arg @ref FL_FSCAN_TX_ABORT_BUFFER_1
  *           @arg @ref FL_FSCAN_TX_ABORT_BUFFER_0AND1
  *           @arg @ref FL_FSCAN_TX_ABORT_BUFFER_2
  *           @arg @ref FL_FSCAN_TX_ABORT_BUFFER_0AND2
  *           @arg @ref FL_FSCAN_TX_ABORT_BUFFER_1AND2
  *           @arg @ref FL_FSCAN_TX_ABORT_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_SetTXAbortRequest(FSCAN_Type *FSCANx, uint32_t bufferX)
{
    MODIFY_REG(FSCANx->TXBCR, FSCAN_TXBCR_TXAR_Msk, bufferX);
}

/**
  * @brief    Get TX abort request
  * @rmtoll   TXBCR    TXAR    FL_FSCAN_GetTXAbortRequest
  * @param    FSCAN FSCAN instance
  * @retval   Returned value fscan be one of the following values:
  *           @arg @ref FL_FSCAN_TX_ABORT_NONE
  *           @arg @ref FL_FSCAN_TX_ABORT_BUFFER_0
  *           @arg @ref FL_FSCAN_TX_ABORT_BUFFER_1
  *           @arg @ref FL_FSCAN_TX_ABORT_BUFFER_0AND1
  *           @arg @ref FL_FSCAN_TX_ABORT_BUFFER_2
  *           @arg @ref FL_FSCAN_TX_ABORT_BUFFER_0AND2
  *           @arg @ref FL_FSCAN_TX_ABORT_BUFFER_1AND2
  *           @arg @ref FL_FSCAN_TX_ABORT_ALL
  */
__STATIC_INLINE uint32_t FL_FSCAN_GetTXAbortRequest(FSCAN_Type *FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->TXBCR, FSCAN_TXBCR_TXAR_Msk));
}

/**
  * @brief    TX buffer empty interrupt enable
  * @rmtoll   TXBCR    TXIE    FL_FSCAN_EnableIT_TXBufferEmpty
  * @param    FSCAN FSCAN instance
  * @param    bufferX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_BUFFER0
  *           @arg @ref FL_FSCAN_BUFFER1
  *           @arg @ref FL_FSCAN_BUFFER2
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_EnableIT_TXBufferEmpty(FSCAN_Type *FSCANx, uint32_t bufferX)
{
    SET_BIT(FSCANx->TXBCR, ((bufferX & 0x7U) << 0x0U));
}

/**
  * @brief    Get TX buffer empty interrupt enable status
  * @rmtoll   TXBCR    TXIE    FL_FSCAN_IsEnabledIT_TXBufferEmpty
  * @param    FSCAN FSCAN instance
  * @param    bufferX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_BUFFER0
  *           @arg @ref FL_FSCAN_BUFFER1
  *           @arg @ref FL_FSCAN_BUFFER2
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsEnabledIT_TXBufferEmpty(FSCAN_Type *FSCANx, uint32_t bufferX)
{
    return (uint32_t)(READ_BIT(FSCANx->TXBCR, ((bufferX & 0x7U) << 0x0U)) == ((bufferX & 0x7U) << 0x0U));
}

/**
  * @brief    TX buffer empty interrupt disable
  * @rmtoll   TXBCR    TXIE    FL_FSCAN_DisableIT_TXBufferEmpty
  * @param    FSCAN FSCAN instance
  * @param    bufferX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_BUFFER0
  *           @arg @ref FL_FSCAN_BUFFER1
  *           @arg @ref FL_FSCAN_BUFFER2
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_DisableIT_TXBufferEmpty(FSCAN_Type *FSCANx, uint32_t bufferX)
{
    CLEAR_BIT(FSCANx->TXBCR, ((bufferX & 0x7U) << 0x0U));
}

/**
  * @brief    Get TX result flag
  * @rmtoll   TXBSR    TXRF    FL_FSCAN_GetTXRsultFlag
  * @param    FSCAN FSCAN instance
  * @param    bufferX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_BUFFER0
  *           @arg @ref FL_FSCAN_BUFFER1
  *           @arg @ref FL_FSCAN_BUFFER2
  * @retval   Returned value fscan be one of the following values:
  *           @arg @ref FL_FSCAN_TX_RESULT_NONE
  *           @arg @ref FL_FSCAN_TX_RESULT_ABORT
  *           @arg @ref FL_FSCAN_TX_RESULT_OK_NOABORT
  *           @arg @ref FL_FSCAN_TX_RESULT_OK_ABORT
  */
__STATIC_INLINE uint32_t FL_FSCAN_GetTXRsultFlag(FSCAN_Type *FSCANx, uint32_t bufferX)
{
    if(bufferX == FL_FSCAN_BUFFER0)
    {
        return (uint32_t)(READ_BIT(FSCANx->TXBSR, (FSCAN_TXBSR_TXRF_Msk << 0U)));
    }
    else
    {
        return (uint32_t)(READ_BIT(FSCANx->TXBSR, (FSCAN_TXBSR_TXRF_Msk << bufferX)));
    }
}

/**
  * @brief    Get TX buffer status
  * @rmtoll   TXBSR    TXS    FL_FSCAN_GetTXBufferStatus
  * @param    FSCAN FSCAN instance
  * @retval   Returned value fscan be one of the following values:
  *           @arg @ref FL_FSCAN_TX_BUFFER_ALL_IDLE
  *           @arg @ref FL_FSCAN_TX_BUFFER_0_BUSY
  *           @arg @ref FL_FSCAN_TX_BUFFER_1_BUSY
  *           @arg @ref FL_FSCAN_TX_BUFFER_0AND1_BUSY
  *           @arg @ref FL_FSCAN_TX_BUFFER_2_BUSY
  *           @arg @ref FL_FSCAN_TX_BUFFER_0AND2_BUSY
  *           @arg @ref FL_FSCAN_TX_BUFFER_1AND2_BUSY
  *           @arg @ref FL_FSCAN_TX_BUFFER_ALL_BUSY
  */
__STATIC_INLINE uint32_t FL_FSCAN_GetTXBufferStatus(FSCAN_Type *FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->TXBSR, FSCAN_TXBSR_TXS_Msk));
}

/**
  * @brief    Clear TX buffer empty flag
  * @rmtoll   TXBSR    TXE    FL_FSCAN_ClearFlag_TXBufferEmpty
  * @param    FSCAN FSCAN instance
  * @param    bufferX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_BUFFER0
  *           @arg @ref FL_FSCAN_BUFFER1
  *           @arg @ref FL_FSCAN_BUFFER2
  */
__STATIC_INLINE void FL_FSCAN_ClearFlag_TXBufferEmpty(FSCAN_Type *FSCANx, uint32_t bufferX)
{
    WRITE_REG(FSCANx->TXBSR, (bufferX & 0x07U) << 0x0U);
}

/**
  * @brief    Get TX buffer empty flag
  * @rmtoll   TXBSR    TXE    FL_FSCAN_IsActiveFlag_TXBuffer1Empty
  * @param    FSCAN FSCAN instance
  *           @arg @ref FL_FSCAN_BUFFER0
  *           @arg @ref FL_FSCAN_BUFFER1
  *           @arg @ref FL_FSCAN_BUFFER2
  */
__STATIC_INLINE uint32_t FL_FSCAN_IsActiveFlag_TXBufferEmpty(FSCAN_Type *FSCANx, uint32_t bufferX)
{
    return (uint32_t)(READ_BIT(FSCANx->TXBSR, ((bufferX & 0x07U) << 0x0U)) == ((bufferX & 0x07) << 0x0U));
}

