XKCANO/ceshi0223/KD001-0115C/Library/inc/fm33lf0xx_fl_fscan.h
/**
  * @brief    Set TXFIFO message identifier code
  * @rmtoll   TXBIDR    IDR    FL_FSCAN_WriteTXMessageID
  * @param    FSCAN FSCAN instance
  * @param    id
  * @param    bufferX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_BUFFER0
  *           @arg @ref FL_FSCAN_BUFFER1
  *           @arg @ref FL_FSCAN_BUFFER2
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_WriteTXMessageID(FSCAN_Type *FSCANx, uint32_t id, uint32_t bufferX)
{
    if(bufferX == FL_FSCAN_BUFFER2)
    {
        MODIFY_REG(*(&(FSCANx->TXB0IDR) + 4 * (bufferX - 2)), FSCAN_TXBIDR_IDR_Msk, (id << FSCAN_TXBIDR_IDR_Pos));
    }
    else
    {
        MODIFY_REG(*(&(FSCANx->TXB0IDR) + 4 * (bufferX - 1)), FSCAN_TXBIDR_IDR_Msk, (id << FSCAN_TXBIDR_IDR_Pos));
    }
}

/**
  * @brief    Get TXFIFO message identifier code
  * @rmtoll   TXBIDR    IDR    FL_FSCAN_ReadTXMessageID
  * @param    FSCAN FSCAN instance
  * @param    bufferX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_BUFFER0
  *           @arg @ref FL_FSCAN_BUFFER1
  *           @arg @ref FL_FSCAN_BUFFER2
  * @retval
  */
__STATIC_INLINE uint32_t FL_FSCAN_ReadTXMessageID(FSCAN_Type *FSCANx, uint32_t bufferX)
{
    if(bufferX == FL_FSCAN_BUFFER2)
    {
        return (uint32_t)(READ_BIT(*(&(FSCANx->TXB0IDR) + 4 * (bufferX - 2)), FSCAN_TXBIDR_IDR_Msk) >> FSCAN_TXBIDR_IDR_Pos);
    }
    else
    {
        return (uint32_t)(READ_BIT(*(&(FSCANx->TXB0IDR) + 4 * (bufferX - 1)), FSCAN_TXBIDR_IDR_Msk) >> FSCAN_TXBIDR_IDR_Pos);
    }
}

/**
  * @brief    Set TXFIFO data length code
  * @rmtoll   TXBDLCR    DLC    FL_FSCAN_WriteTXMessageLength
  * @param    FSCAN FSCAN instance
  * @param    length
  * @param    bufferX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_BUFFER0
  *           @arg @ref FL_FSCAN_BUFFER1
  *           @arg @ref FL_FSCAN_BUFFER2
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_WriteTXMessageLength(FSCAN_Type *FSCANx, uint32_t length, uint32_t bufferX)
{
    if(bufferX == FL_FSCAN_BUFFER2)
    {
        MODIFY_REG(*(&(FSCANx->TXB0DLCR) + 4 * (bufferX - 2)), FSCAN_TXBDLCR_DLC_Msk, (length << FSCAN_TXBDLCR_DLC_Pos));
    }
    else
    {
        MODIFY_REG(*(&(FSCANx->TXB0DLCR) + 4 * (bufferX - 1)), FSCAN_TXBDLCR_DLC_Msk, (length << FSCAN_TXBDLCR_DLC_Pos));
    }
}

/**
  * @brief    Get TXFIFO data length code
  * @rmtoll   TXBDLCR    DLC    FL_FSCAN_ReadTXMessageLength
  * @param    FSCAN FSCAN instance
  * @param    bufferX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_BUFFER0
  *           @arg @ref FL_FSCAN_BUFFER1
  *           @arg @ref FL_FSCAN_BUFFER2
  * @retval
  */
__STATIC_INLINE uint32_t FL_FSCAN_ReadTXMessageLength(FSCAN_Type *FSCANx, uint32_t bufferX)
{
    if(bufferX == FL_FSCAN_BUFFER2)
    {
        return (uint32_t)(READ_BIT(*(&(FSCANx->TXB0DLCR) + 4 * (bufferX - 2)), FSCAN_TXBDLCR_DLC_Msk) >> FSCAN_TXBDLCR_DLC_Pos);
    }
    else
    {
        return (uint32_t)(READ_BIT(*(&(FSCANx->TXB0DLCR) + 4 * (bufferX - 1)), FSCAN_TXBDLCR_DLC_Msk) >> FSCAN_TXBDLCR_DLC_Pos);
    }
}

/**
  * @brief    Set TXFIFO data word1
  * @rmtoll   TXBDW1R    DB    FL_FSCAN_WriteTXMessageWord1
  * @param    FSCAN FSCAN instance
  * @param    word
  * @param    bufferX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_BUFFER0
  *           @arg @ref FL_FSCAN_BUFFER1
  *           @arg @ref FL_FSCAN_BUFFER2
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_WriteTXMessageWord1(FSCAN_Type *FSCANx, uint32_t word, uint32_t bufferX)
{
    if(bufferX == FL_FSCAN_BUFFER2)
    {
        MODIFY_REG(*(&(FSCANx->TXB0DW1R) + 4 * (bufferX - 2)), FSCAN_TXBDW1R_DB_Msk, (word << FSCAN_TXBDW1R_DB_Pos));
    }
    else
    {
        MODIFY_REG(*(&(FSCANx->TXB0DW1R) + 4 * (bufferX - 1)), FSCAN_TXBDW1R_DB_Msk, (word << FSCAN_TXBDW1R_DB_Pos));
    }
}

/**
  * @brief    Get TXFIFO data word1
  * @rmtoll   TXBDW1R    DB    FL_FSCAN_ReadTXMessageWord1
  * @param    FSCAN FSCAN instance
  * @param    bufferX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_BUFFER0
  *           @arg @ref FL_FSCAN_BUFFER1
  *           @arg @ref FL_FSCAN_BUFFER2
  * @retval
  */
__STATIC_INLINE uint32_t FL_FSCAN_ReadTXMessageWord1(FSCAN_Type *FSCANx, uint32_t bufferX)
{
    if(bufferX == FL_FSCAN_BUFFER2)
    {
        return (uint32_t)(READ_BIT(*(&(FSCANx->TXB0DW1R) + 4 * (bufferX - 2)), FSCAN_TXBDW1R_DB_Msk) >> FSCAN_TXBDW1R_DB_Pos);
    }
    else
    {
        return (uint32_t)(READ_BIT(*(&(FSCANx->TXB0DW1R) + 4 * (bufferX - 1)), FSCAN_TXBDW1R_DB_Msk) >> FSCAN_TXBDW1R_DB_Pos);
    }
}

/**
  * @brief    Set TXFIFO data word2
  * @rmtoll   TXBDW2R    DB    FL_FSCAN_WriteTXMessageWord2
  * @param    FSCAN FSCAN instance
  * @param    word
  * @param    bufferX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_BUFFER0
  *           @arg @ref FL_FSCAN_BUFFER1
  *           @arg @ref FL_FSCAN_BUFFER2
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_WriteTXMessageWord2(FSCAN_Type *FSCANx, uint32_t word, uint32_t bufferX)
{
    if(bufferX == FL_FSCAN_BUFFER2)
    {
        MODIFY_REG(*(&(FSCANx->TXB0DW2R) + 4 * (bufferX - 2)), FSCAN_TXBDW2R_DB_Msk, (word << FSCAN_TXBDW2R_DB_Pos));
    }
    else
    {
        MODIFY_REG(*(&(FSCANx->TXB0DW2R) + 4 * (bufferX - 1)), FSCAN_TXBDW2R_DB_Msk, (word << FSCAN_TXBDW2R_DB_Pos));
    }
}

/**
  * @brief    Get TXFIFO data word2
  * @rmtoll   TXBDW2R    DB    FL_FSCAN_ReadTXMessageWord2
  * @param    FSCAN FSCAN instance
  * @param    bufferX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_BUFFER0
  *           @arg @ref FL_FSCAN_BUFFER1
  *           @arg @ref FL_FSCAN_BUFFER2
  * @retval
  */
__STATIC_INLINE uint32_t FL_FSCAN_ReadTXMessageWord2(FSCAN_Type *FSCANx, uint32_t bufferX)
{
    if(bufferX == FL_FSCAN_BUFFER2)
    {
        return (uint32_t)(READ_BIT(*(&(FSCANx->TXB0DW2R) + 4 * (bufferX - 2)), FSCAN_TXBDW2R_DB_Msk) >> FSCAN_TXBDW2R_DB_Pos);
    }
    else
    {
        return (uint32_t)(READ_BIT(*(&(FSCANx->TXB0DW2R) + 4 * (bufferX - 1)), FSCAN_TXBDW2R_DB_Msk) >> FSCAN_TXBDW2R_DB_Pos);
    }
}

/**
  * @brief    Set RXFIFO message identifier code
  * @rmtoll   RXFIDR    IDR    FL_FSCAN_WriteRXMessageID
  * @param    FSCAN FSCAN instance
  * @param    id
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_WriteRXMessageID(FSCAN_Type *FSCANx, uint32_t id)
{
    MODIFY_REG(FSCANx->RXFIDR, FSCAN_RXFIDR_IDR_Msk, (id << FSCAN_RXFIDR_IDR_Pos));
}

/**
  * @brief    Get RXFIFO message identifier code
  * @rmtoll   RXFIDR    IDR    FL_FSCAN_ReadRXMessageID
  * @param    FSCAN FSCAN instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_FSCAN_ReadRXMessageID(FSCAN_Type *FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXFIDR, FSCAN_RXFIDR_IDR_Msk) >> FSCAN_RXFIDR_IDR_Pos);
}

/**
  * @brief    Set RXFIFO data length code
  * @rmtoll   RXFDLCR    DLC    FL_FSCAN_WriteRXMessageLength
  * @param    FSCAN FSCAN instance
  * @param    length
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_WriteRXMessageLength(FSCAN_Type *FSCANx, uint32_t length)
{
    MODIFY_REG(FSCANx->RXFDLCR, FSCAN_RXFDLCR_DLC_Msk, (length << FSCAN_RXFDLCR_DLC_Pos));
}

/**
  * @brief    Get RXFIFO data length code
  * @rmtoll   RXFDLCR    DLC    FL_FSCAN_ReadRXMessageLength
  * @param    FSCAN FSCAN instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_FSCAN_ReadRXMessageLength(FSCAN_Type *FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXFDLCR, FSCAN_RXFDLCR_DLC_Msk) >> FSCAN_RXFDLCR_DLC_Pos);
}

/**
  * @brief    Set RXFIFO data word1
  * @rmtoll   RXFDW1R    DB    FL_FSCAN_WriteRXMessageWord1
  * @param    FSCAN FSCAN instance
  * @param    word
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_WriteRXMessageWord1(FSCAN_Type *FSCANx, uint32_t word)
{
    MODIFY_REG(FSCANx->RXFDW1R, FSCAN_RXFDW1R_DB_Msk, (word << FSCAN_RXFDW1R_DB_Pos));
}

/**
  * @brief    Get RXFIFO data word1
  * @rmtoll   RXFDW1R    DB    FL_FSCAN_ReadRXMessageWord1
  * @param    FSCAN FSCAN instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_FSCAN_ReadRXMessageWord1(FSCAN_Type *FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXFDW1R, FSCAN_RXFDW1R_DB_Msk) >> FSCAN_RXFDW1R_DB_Pos);
}

/**
  * @brief    Set RXFIFO data word2
  * @rmtoll   RXFDW2R    DB    FL_FSCAN_WriteRXMessageWord2
  * @param    FSCAN FSCAN instance
  * @param    word
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_WriteRXMessageWord2(FSCAN_Type *FSCANx, uint32_t word)
{
    MODIFY_REG(FSCANx->RXFDW2R, FSCAN_RXFDW2R_DB_Msk, (word << FSCAN_RXFDW2R_DB_Pos));
}

/**
  * @brief    Get RXFIFO data word2
  * @rmtoll   RXFDW2R    DB    FL_FSCAN_ReadRXMessageWord2
  * @param    FSCAN FSCAN instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_FSCAN_ReadRXMessageWord2(FSCAN_Type *FSCANx)
{
    return (uint32_t)(READ_BIT(FSCANx->RXFDW2R, FSCAN_RXFDW2R_DB_Msk) >> FSCAN_RXFDW2R_DB_Pos);
}

/**
  * @brief    Acceptance filter 4 enable
  * @rmtoll   AFR    MSKM    FL_FSCAN_Filter_SetMaskMode
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @param    mode This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_MASKMODE_MASK
  *           @arg @ref FL_FSCAN_MASKMODE_ID
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_Filter_SetMaskMode(FSCAN_Type *FSCANx, uint32_t filterX, uint32_t mode)
{
    MODIFY_REG(FSCANx->AFCFGR, (FSCAN_AFCFGR_MSKM_Msk << filterX), (mode << filterX));
}

/**
  * @brief    Acceptance filter 4 enable
  * @rmtoll   AFR    MSKM    FL_FSCAN_Filter_GetMaskMode
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @param    mode This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_MASKMODE_MASK
  *           @arg @ref FL_FSCAN_MASKMODE_ID
  * @retval   None
  */
__STATIC_INLINE uint32_t FL_FSCAN_Filter_GetMaskMode(FSCAN_Type *FSCANx, uint32_t filterX)
{
    return (uint32_t)((READ_BIT(FSCANx->AFCFGR, (FSCAN_AFCFGR_MSKM_Msk << filterX))) >> filterX);
}


/**
  * @brief    Acceptance filter 4 enable
  * @rmtoll   AFR    FSC    FL_FSCAN_Filter_SetIDMode
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @param    mode This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_IDMODE_32BIT
  *           @arg @ref FL_FSCAN_IDMODE_16BIT
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_Filter_SetIDMode(FSCAN_Type *FSCANx, uint32_t filterX, uint32_t mode)
{
    MODIFY_REG(FSCANx->AFCFGR, (FSCAN_AFCFGR_FSC_Msk << filterX), (mode << filterX));
}

/**
  * @brief    Acceptance filter 4 enable
  * @rmtoll   AFR    FSC    FL_FSCAN_Filter_GetIDMode
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @param    mode This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_MASKMODE_MASK
  *           @arg @ref FL_FSCAN_MASKMODE_ID
  * @retval   None
  */
__STATIC_INLINE uint32_t FL_FSCAN_Filter_GetIDMode(FSCAN_Type *FSCANx, uint32_t filterX)
{
    return (uint32_t)((READ_BIT(FSCANx->AFCFGR, (FSCAN_AFCFGR_FSC_Msk << filterX))) >> filterX);
}


/**
  * @brief    Acceptance filter 4 enable
  * @rmtoll   AFR    UAF    FL_FSCAN_Filter_Enable
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_Filter_Enable(FSCAN_Type *FSCANx, uint32_t filterX)
{
    SET_BIT(FSCANx->AFCR, FSCAN_AFCR_UAF_Msk << filterX);
}

/**
  * @brief    Get acceptance filter 4 enable status
  * @rmtoll   AFR    UAF    FL_FSCAN_Filter_IsEnabled
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_Filter_IsEnabled(FSCAN_Type *FSCANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(FSCANx->AFCR, ((FSCAN_AFCR_UAF_Msk << filterX) & 0xffff)) == ((FSCAN_AFCR_UAF_Msk << filterX) & 0xffff));
}

/**
  * @brief    Acceptance filter 4 disable
  * @rmtoll   AFR    UAF    FL_FSCAN_Filter_Disable
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_Filter_Disable(FSCAN_Type *FSCANx, uint32_t filterX)
{
    CLEAR_BIT(FSCANx->AFCR, ((FSCAN_AFCR_UAF_Msk << filterX) & 0xffff));
}
/**
  * @brief    Enable RTR participate filter compare
  * @rmtoll   AFMR    AMRTR    FL_FSCAN_FilterEXT_EnableRTRCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_FilterEXT_EnableRTRCompare(FSCAN_Type *FSCANx, uint32_t filterX)
{
    SET_BIT(*(&(FSCANx->AFMR0) + 2 * filterX), FSCAN_AFMR_AMRTR_Msk);
}

/**
  * @brief    Disable RTR participate filter compare
  * @rmtoll   AFMR    AMRTR    FL_FSCAN_FilterEXT_DisableRTRCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval   Returned value fscan be one of the following values:
  */
__STATIC_INLINE void FL_FSCAN_FilterEXT_DisableRTRCompare(FSCAN_Type *FSCANx, uint32_t filterX)
{
    CLEAR_BIT(*(&(FSCANx->AFMR0) + 2 * filterX), FSCAN_AFMR_AMRTR_Msk);
}

/**
  * @brief    Get RTR participate filter compare Enable Status
  * @rmtoll   AFMR    AMRTR    FL_FSCAN_FilterEXT_IsEnabledRTRCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval   None
  */
__STATIC_INLINE uint32_t FL_FSCAN_FilterEXT_IsEnabledRTRCompare(FSCAN_Type *FSCANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*(&(FSCANx->AFMR0) + 2 * filterX), FSCAN_AFMR_AMRTR_Msk) == FSCAN_AFMR_AMRTR_Msk);
}

/**
  * @brief    Set ID low 18bit participate filter compare
  * @rmtoll   AFMR    AMID18    FL_FSCAN_FilterEXT_WriteEXTIDCompareMask
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @param    id18
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_FilterEXT_WriteEXTIDCompareMask(FSCAN_Type *FSCANx, uint32_t filterX, uint32_t id18)
{
    MODIFY_REG(*(&(FSCANx->AFMR0) + 2 * filterX), (0x3ffffU << FSCAN_AFMR_AMID18_Pos), (id18 << FSCAN_AFMR_AMID18_Pos));
}

/**
  * @brief    Get ID low 18bit participate filter compare
  * @rmtoll   AFMR    AMID18    FL_FSCAN_FilterEXT_ReadEXTIDCompareMask
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval
  */
__STATIC_INLINE uint32_t FL_FSCAN_FilterEXT_ReadEXTIDCompareMask(FSCAN_Type *FSCANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*(&(FSCANx->AFMR0) + 2 * filterX), (0x3ffffU << FSCAN_AFMR_AMID18_Pos)) >> FSCAN_AFMR_AMID18_Pos);
}

