XKCANO/ceshi0223/KD001-0115C/Library/inc/fm33lf0xx_fl_fscan.h
/**
  * @brief    Get SRR participate filter compare Enable Status
  * @rmtoll   AFMR    AMSRR    FL_FSCAN_FilterSTD2_IsEnabledSRRCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_FSCAN_FilterSTD2_IsEnabledSRRCompare(FSCAN_Type *FSCANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*(&(FSCANx->AFMR0) + 2 * filterX), FSCAN_AFMRSTD2_AMSRR_Msk) == FSCAN_AFMRSTD2_AMSRR_Msk);
}

/**
  * @brief    Set ID high 11bit participate filter compare
  * @rmtoll   AFMR    AMID11    FL_FSCAN_FilterEXT_WriteIDCompareMask
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @param    id11
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_FilterEXT_WriteIDCompareMask(FSCAN_Type *FSCANx, uint32_t filterX, uint32_t id11)
{
    MODIFY_REG(*((&(FSCANx->AFMR0)) + 2 * filterX), (0x7ffU << FSCAN_AFMR_AMID11_Pos), id11 << FSCAN_AFMR_AMID11_Pos);
}

/**
  * @brief    Get ID high 11bit participate filter compare
  * @rmtoll   AFMR    AMID11    FL_FSCAN_FilterEXT_ReadIDCompareMask
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval
  */
__STATIC_INLINE uint32_t FL_FSCAN_FilterEXT_ReadIDCompareMask(FSCAN_Type *FSCANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*((&(FSCANx->AFMR0)) + 2 * filterX), (0x7ffU << FSCAN_AFMR_AMID11_Pos)) >> FSCAN_AFMR_AMID11_Pos);
}

/**
  * @brief    Set ID high 11bit participate filter compare
  * @rmtoll   AFMR    AMID11    FL_FSCAN_FilterSTD1_WriteIDCompareMask
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @param    id11
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_FilterSTD1_WriteIDCompareMask(FSCAN_Type *FSCANx, uint32_t filterX, uint32_t id11)
{
    MODIFY_REG(*((&(FSCANx->AFMR0)) + 2 * filterX), (0x7ffU << FSCAN_AFMRSTD1_AMID11_Pos), id11 << FSCAN_AFMRSTD1_AMID11_Pos);
}

/**
  * @brief    Get ID high 11bit participate filter compare
  * @rmtoll   AFMR    AMID11    FL_FSCAN_FilterSTD1_ReadIDCompareMask
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval
  */
__STATIC_INLINE uint32_t FL_FSCAN_FilterSTD1_ReadIDCompareMask(FSCAN_Type *FSCANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*((&(FSCANx->AFMR0)) + 2 * filterX), (0x7ffU << FSCAN_AFMRSTD1_AMID11_Pos)) >> FSCAN_AFMRSTD1_AMID11_Pos);
}

/**
  * @brief    Set ID high 11bit participate filter compare
  * @rmtoll   AFMR    AMID11    FL_FSCAN_FilterSTD2_WriteIDCompareMask
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @param    id11
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_FilterSTD2_WriteIDCompareMask(FSCAN_Type *FSCANx, uint32_t filterX, uint32_t id11)
{
    MODIFY_REG(*((&(FSCANx->AFMR0)) + 2 * filterX), (0x7ffU << FSCAN_AFMRSTD2_AMID11_Pos), id11 << FSCAN_AFMRSTD2_AMID11_Pos);
}

/**
  * @brief    Get ID high 11bit participate filter compare
  * @rmtoll   AFMR    AMID11    FL_FSCAN_FilterSTD1_ReadIDCompareMask
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval
  */
__STATIC_INLINE uint32_t FL_FSCAN_FilterSTD2_ReadIDCompareMask(FSCAN_Type *FSCANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*((&(FSCANx->AFMR0)) + 2 * filterX), (0x7ffU << FSCAN_AFMRSTD2_AMID11_Pos)) >> FSCAN_AFMRSTD2_AMID11_Pos);
}

/**
  * @brief    Set filter RTR
  * @rmtoll   AFIR    AIRTR    FL_FSCAN_FilterEXT_SetRTRCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @param    rtr This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_RTR_BIT_LOW
  *           @arg @ref FL_FSCAN_RTR_BIT_HIGH
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_FilterEXT_SetRTRCompare(FSCAN_Type *FSCANx, uint32_t filterX, uint32_t rtr)
{
    MODIFY_REG(*((&(FSCANx->AFIR0)) + 2 * filterX), FSCAN_AFIR_AIRTR_Msk, rtr);
}

/**
  * @brief    Get filter RTR
  * @rmtoll   AFIR    AIRTR    FL_FSCAN_FilterEXT_GetRTRCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval   Returned value fscan be one of the following values:
  *           @arg @ref FL_FSCAN_RTR_BIT_LOW
  *           @arg @ref FL_FSCAN_RTR_BIT_HIGH
  */
__STATIC_INLINE uint32_t FL_FSCAN_FilterEXT_GetRTRCompare(FSCAN_Type *FSCANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*((&(FSCANx->AFIR0)) + 2 * filterX), FSCAN_AFIR_AIRTR_Msk));
}

/**
  * @brief    Set filter ID[17:0]
  * @rmtoll   AFIR    AIID18    FL_FSCAN_FilterEXT_WriteEXTIDCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @param    id18
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_FilterEXT_WriteEXTIDCompare(FSCAN_Type *FSCANx, uint32_t filterX, uint32_t id18)
{
    MODIFY_REG(*(&(FSCANx->AFIR0) + 2 * filterX), (0x3ffffU << FSCAN_AFIR_AIID18_Pos), (id18 << FSCAN_AFIR_AIID18_Pos));
}

/**
  * @brief    Get filter ID[17:0]
  * @rmtoll   AFIR    AIID18    FL_FSCAN_FilterEXT_ReadEXTIDCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval
  */
__STATIC_INLINE uint32_t FL_FSCAN_FilterEXT_ReadEXTIDCompare(FSCAN_Type *FSCANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*(&(FSCANx->AFIR0) + 2 * filterX), (0x3ffffU << FSCAN_AFIR_AIID18_Pos)) >> FSCAN_AFIR_AIID18_Pos);
}


/**
  * @brief    Set filter ID[17:15]
  * @rmtoll   AFIR    AIID3    FL_FSCAN_FilterSTD1_WriteEXTIDCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @param    id18
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_FilterSTD1_WriteEXTIDCompare(FSCAN_Type *FSCANx, uint32_t filterX, uint32_t id3)
{
    MODIFY_REG(*(&(FSCANx->AFIR0) + 2 * filterX), FSCAN_AFIRSTD1_AIID3_Msk, (id3 << FSCAN_AFIRSTD1_AIID3_Pos));
}

/**
  * @brief    Get filter ID[17:15]
  * @rmtoll   AFIR    AIID3    FL_FSCAN_FilterSTD1_ReadEXTIDCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval
  */
__STATIC_INLINE uint32_t FL_FSCAN_FilterSTD1_ReadEXTIDCompare(FSCAN_Type *FSCANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*(&(FSCANx->AFIR0) + 2 * filterX), FSCAN_AFIRSTD1_AIID3_Msk) >> FSCAN_AFIRSTD1_AIID3_Pos);
}

/**
  * @brief    Set filter ID[17:15]
  * @rmtoll   AFIR    AIID3    FL_FSCAN_FilterSTD2_WriteEXTIDCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @param    id18
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_FilterSTD2_WriteEXTIDCompare(FSCAN_Type *FSCANx, uint32_t filterX, uint32_t id3)
{
    MODIFY_REG(*(&(FSCANx->AFIR0) + 2 * filterX), FSCAN_AFIRSTD2_AIID3_Msk, (id3 << FSCAN_AFIRSTD2_AIID3_Pos));
}

/**
  * @brief    Get filter ID[17:15]
  * @rmtoll   AFIR    AIID3    FL_FSCAN_FilterSTD2_ReadEXTIDCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval
  */
__STATIC_INLINE uint32_t FL_FSCAN_FilterSTD2_ReadEXTIDCompare(FSCAN_Type *FSCANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*(&(FSCANx->AFIR0) + 2 * filterX), FSCAN_AFIRSTD2_AIID3_Msk) >> FSCAN_AFIRSTD2_AIID3_Pos);
}
/**
  * @brief    Set filter IDE
  * @rmtoll   AFIR    AIIDE    FL_FSCAN_FilterEXT_SetIDECompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @param    ide This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_IDE_BIT_LOW
  *           @arg @ref FL_FSCAN_IDE_BIT_HIGH
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_FilterEXT_SetIDECompare(FSCAN_Type *FSCANx, uint32_t filterX, uint32_t ide)
{
    MODIFY_REG(*((&(FSCANx->AFIR0)) + 2 * filterX), FSCAN_AFIR_AIIDE_Msk, ide);
}

/**
  * @brief    Get filter IDE
  * @rmtoll   AFIR    AIIDE    FL_FSCAN_FilterEXT_GetIDECompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval   Returned value fscan be one of the following values:
  *           @arg @ref FL_FSCAN_IDE_BIT_LOW
  *           @arg @ref FL_FSCAN_IDE_BIT_HIGH
  */
__STATIC_INLINE uint32_t FL_FSCAN_FilterEXT_GetIDECompare(FSCAN_Type *FSCANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*((&(FSCANx->AFIR0)) + 2 * filterX), FSCAN_AFIR_AIIDE_Msk));
}

/**
  * @brief    Set filter IDE
  * @rmtoll   AFIR    AIIDE    FL_FSCAN_FilterSTD1_SetIDECompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @param    ide This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_STD1IDE_BIT_LOW
  *           @arg @ref FL_FSCAN_STD1IDE_BIT_HIGH
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_FilterSTD1_SetIDECompare(FSCAN_Type *FSCANx, uint32_t filterX, uint32_t ide)
{
    MODIFY_REG(*((&(FSCANx->AFIR0)) + 2 * filterX), FSCAN_AFIRSTD1_AIIDE_Msk, ide);
}

/**
  * @brief    Get filter IDE
  * @rmtoll   AFIR    AIIDE    FL_FSCAN_FilterSTD1_GetIDECompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval   Returned value fscan be one of the following values:
  *           @arg @ref FL_FSCAN_STD1IDE_BIT_LOW
  *           @arg @ref FL_FSCAN_STD1IDE_BIT_HIGH
  */
__STATIC_INLINE uint32_t FL_FSCAN_FilterSTD1_GetIDECompare(FSCAN_Type *FSCANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*((&(FSCANx->AFIR0)) + 2 * filterX), FSCAN_AFIRSTD1_AIIDE_Msk));
}

/**
  * @brief    Set filter IDE
  * @rmtoll   AFIR    AIIDE    FL_FSCAN_FilterSTD2_SetIDECompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @param    ide This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_STD2IDE_BIT_LOW
  *           @arg @ref FL_FSCAN_STD2IDE_BIT_HIGH
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_FilterSTD2_SetIDECompare(FSCAN_Type *FSCANx, uint32_t filterX, uint32_t ide)
{
    MODIFY_REG(*((&(FSCANx->AFIR0)) + 2 * filterX), FSCAN_AFIRSTD2_AIIDE_Msk, ide);
}

