XKCANO/ceshi0223/KD001-0115C/Library/inc/fm33lf0xx_fl_fscan.h
/**
  * @brief    Get filter IDE
  * @rmtoll   AFIR    AIIDE    FL_FSCAN_FilterSTD2_GetIDECompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval   Returned value fscan be one of the following values:
  *           @arg @ref FL_FSCAN_STD2IDE_BIT_LOW
  *           @arg @ref FL_FSCAN_STD2IDE_BIT_HIGH
  */
__STATIC_INLINE uint32_t FL_FSCAN_FilterSTD2_GetIDECompare(FSCAN_Type *FSCANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*((&(FSCANx->AFIR0)) + 2 * filterX), FSCAN_AFIRSTD2_AIIDE_Msk));
}
/**
  * @brief    Set filter SRR
  * @rmtoll   AFIR    AISRR    FL_FSCAN_FilterEXT_SetSRRCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @param    srr This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_SRR_BIT_LOW
  *           @arg @ref FL_FSCAN_SRR_BIT_HIGH
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_FilterEXT_SetSRRCompare(FSCAN_Type *FSCANx, uint32_t filterX, uint32_t srr)
{
    MODIFY_REG(*((&(FSCANx->AFIR0)) + 2 * filterX), FSCAN_AFIR_AISRR_Msk, srr);
}

/**
  * @brief    Get filter SRR
  * @rmtoll   AFIR    AISRR    FL_FSCAN_FilterEXT_GetSRRCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval   Returned value fscan be one of the following values:
  *           @arg @ref FL_FSCAN_SRR_BIT_LOW
  *           @arg @ref FL_FSCAN_SRR_BIT_HIGH
  */
__STATIC_INLINE uint32_t FL_FSCAN_FilterEXT_GetSRRCompare(FSCAN_Type *FSCANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*((&(FSCANx->AFIR0)) + 2 * filterX), FSCAN_AFIR_AISRR_Msk));
}

/**
  * @brief    Set filter SRR
  * @rmtoll   AFIR    AISRR    FL_FSCAN_FilterSTD1_SetSRRCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @param    srr This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_STD1SRR_BIT_LOW
  *           @arg @ref FL_FSCAN_STD1SRR_BIT_HIGH
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_FilterSTD1_SetSRRCompare(FSCAN_Type *FSCANx, uint32_t filterX, uint32_t srr)
{
    MODIFY_REG(*((&(FSCANx->AFIR0)) + 2 * filterX), FSCAN_AFIRSTD1_AISRR_Msk, srr);
}

/**
  * @brief    Get filter SRR
  * @rmtoll   AFIR    AISRR    FL_FSCAN_FilterSTD1_GetSRRCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval   Returned value fscan be one of the following values:
  *           @arg @ref FL_FSCAN_STD1SRR_BIT_LOW
  *           @arg @ref FL_FSCAN_STD1SRR_BIT_HIGH
  */
__STATIC_INLINE uint32_t FL_FSCAN_FilterSTD1_GetSRRCompare(FSCAN_Type *FSCANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*((&(FSCANx->AFIR0)) + 2 * filterX), FSCAN_AFIRSTD1_AISRR_Msk));
}

/**
  * @brief    Set filter SRR
  * @rmtoll   AFIR    AISRR    FL_FSCAN_FilterSTD2_SetSRRCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @param    srr This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_STD2SRR_BIT_LOW
  *           @arg @ref FL_FSCAN_STD2SRR_BIT_HIGH
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_FilterSTD2_SetSRRCompare(FSCAN_Type *FSCANx, uint32_t filterX, uint32_t srr)
{
    MODIFY_REG(*((&(FSCANx->AFIR0)) + 2 * filterX), FSCAN_AFIRSTD2_AISRR_Msk, srr);
}

/**
  * @brief    Get filter SRR
  * @rmtoll   AFIR    AISRR    FL_FSCAN_FilterSTD2_GetSRRCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval   Returned value fscan be one of the following values:
  *           @arg @ref FL_FSCAN_STD2SRR_BIT_LOW
  *           @arg @ref FL_FSCAN_STD2SRR_BIT_HIGH
  */
__STATIC_INLINE uint32_t FL_FSCAN_FilterSTD2_GetSRRCompare(FSCAN_Type *FSCANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*((&(FSCANx->AFIR0)) + 2 * filterX), FSCAN_AFIRSTD2_AISRR_Msk));
}
/**
  * @brief    Set filterID[28:18]
  * @rmtoll   AFIR    AIID11    FL_FSCAN_FilterEXT_WriteIDCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @param    id11
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_FilterEXT_WriteIDCompare(FSCAN_Type *FSCANx, uint32_t filterX, uint32_t id11)
{
    MODIFY_REG(*((&(FSCANx->AFIR0)) + 2 * filterX), FSCAN_AFIR_AIID11_Msk, id11 << FSCAN_AFIR_AIID11_Pos);
}

/**
  * @brief    Get filter ID[28:18]
  * @rmtoll   AFIR    AIID11    FL_FSCAN_FilterEXT_ReadIDCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval
  */
__STATIC_INLINE uint32_t FL_FSCAN_FilterEXT_ReadIDCompare(FSCAN_Type *FSCANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*((&(FSCANx->AFIR0)) + 2 * filterX), FSCAN_AFIR_AIID11_Msk) >> FSCAN_AFIR_AIID11_Pos);
}

/**
  * @brief    Set filterID[28:18]
  * @rmtoll   AFIR    AIID11    FL_FSCAN_FilterSTD1_WriteIDCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @param    id11
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_FilterSTD1_WriteIDCompare(FSCAN_Type *FSCANx, uint32_t filterX, uint32_t id11)
{
    MODIFY_REG(*((&(FSCANx->AFIR0)) + 2 * filterX), FSCAN_AFIRSTD1_AIID11_Msk, id11 << FSCAN_AFIRSTD1_AIID11_Pos);
}

/**
  * @brief    Get filter ID[28:18]
  * @rmtoll   AFIR    AIID11    FL_FSCAN_FilterSTD1_ReadIDCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval
  */
__STATIC_INLINE uint32_t FL_FSCAN_FilterSTD1_ReadIDCompare(FSCAN_Type *FSCANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*((&(FSCANx->AFIR0)) + 2 * filterX), FSCAN_AFIRSTD1_AIID11_Msk) >> FSCAN_AFIRSTD1_AIID11_Pos);
}

/**
  * @brief    Set filterID[28:18]
  * @rmtoll   AFIR    AIID11    FL_FSCAN_FilterSTD2_WriteIDCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @param    id11
  * @retval   None
  */
__STATIC_INLINE void FL_FSCAN_FilterSTD2_WriteIDCompare(FSCAN_Type *FSCANx, uint32_t filterX, uint32_t id11)
{
    MODIFY_REG(*((&(FSCANx->AFIR0)) + 2 * filterX), FSCAN_AFIRSTD2_AIID11_Msk, id11 << FSCAN_AFIRSTD2_AIID11_Pos);
}

/**
  * @brief    Get filter ID[28:18]
  * @rmtoll   AFIR    AIID11    FL_FSCAN_FilterSTD2_ReadIDCompare
  * @param    FSCAN FSCAN instance
  * @param    filterX This parameter fscan be one of the following values:
  *           @arg @ref FL_FSCAN_FILTER1
  *           @arg @ref FL_FSCAN_FILTER2
  *           @arg @ref FL_FSCAN_FILTER3
  *           @arg @ref FL_FSCAN_FILTER4
  *           @arg @ref FL_FSCAN_FILTER5
  *           @arg @ref FL_FSCAN_FILTER6
  *           @arg @ref FL_FSCAN_FILTER7
  *           @arg @ref FL_FSCAN_FILTER8
  *           @arg @ref FL_FSCAN_FILTER9
  *           @arg @ref FL_FSCAN_FILTER10
  *           @arg @ref FL_FSCAN_FILTER11
  *           @arg @ref FL_FSCAN_FILTER12
  *           @arg @ref FL_FSCAN_FILTER13
  *           @arg @ref FL_FSCAN_FILTER14
  *           @arg @ref FL_FSCAN_FILTER15
  *           @arg @ref FL_FSCAN_FILTER16
  * @retval
  */
__STATIC_INLINE uint32_t FL_FSCAN_FilterSTD2_ReadIDCompare(FSCAN_Type *FSCANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*((&(FSCANx->AFIR0)) + 2 * filterX), FSCAN_AFIRSTD2_AIID11_Msk) >> FSCAN_AFIRSTD2_AIID11_Pos);
}
/**
  * @}
  */

/** @defgroup FSCAN_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_FSCAN_Init(FSCAN_Type *FSCANx, FL_FSCAN_InitTypeDef *FSCAN_InitStruct);
FL_ErrorStatus FL_FSCAN_FilterInit(FSCAN_Type *FSCANx, FL_FSCAN_FilterInitTypeDef *FSCAN_FilterInitStruct, uint32_t filterX);
void FL_FSCAN_StructInit(FL_FSCAN_InitTypeDef *FSCAN_InitStruct);
void FL_FSCAN_StructFilterInit(FL_FSCAN_FilterInitTypeDef *FSCAN_FilterInitStruct);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LF0XX_FL_FSCAN_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-04-07*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
